<schedule><conference><title>CFP Capitole du Libre 2017</title><venue>ENSEEIHT, 2 rue Charles Camichel, Toulouse</venue><city>Toulouse</city><start_date>2017-11-18</start_date><end_date>2017-11-19</end_date><days_count>2</days_count></conference><day date="2017-11-18" index="1"><room name="A001" /><event id="129"><persons /><person id="102">&#201;lo&#239;s</person><start>10:30</start><duration>01:00</duration><room>A001</room><slug>du-logiciel-libre-a-la-monnaie-libre</slug><title>Du Logiciel Libre &#224; la Monnaie Libre</title><subtitle /><track>Le Libre en g&#233;n&#233;ral</track><type>conference</type><language /><description>Et si l'on appliquait les principes du Logiciel Libre a l'&#201;conomie ?
Il fallait y penser, St&#233;phane Laborde l'a fait en 2010 en posant 4 libert&#233;s &#233;conomiques qui sont la suite logique des 4 libert&#233;s logicielles de Stallman.
7 ans plus tard une bande de geek ont donn&#233; vie a cette id&#233;e et le 8 mars 2017 est n&#233;e la 1&#232;re monnaie libre :  la &#286;1 (prononcez "June").
Comment &#231;a marche ? A quoi &#231;a sert ? Viens donc apprendre &#224; &#233;changer en &#286;1 :)</description><links /></event><event id="234"><persons /><person id="187">Delphine Malassingne</person><start>11:30</start><duration>01:00</duration><room>A001</room><slug>linteret-du-libre-explique-a-ma-mere</slug><title>L&#8217;int&#233;r&#234;t du libre expliqu&#233; &#224; ma m&#232;re</title><subtitle /><track>&#201;ducation</track><type>conference</type><language /><description>&#171; C&#8217;est quoi le &#8220;libre&#8221; ? Ah bon, c&#8217;est mieux que Google ? c&#8217;est pratique pourtant Google&#8230; Ok, tu m&#8217;as convaincue ; je fais comment maintenant ? &#187;

Trois questions que je voudrais que ma m&#232;re (mon voisin/ma ni&#232;ce/mon oncle) me pose. Trois questions auxquelles cette conf&#233;rence devrait apporter des r&#233;ponses.</description><links /></event><event id="228"><persons /><person id="183">R&#233;mi Boulle</person><start>15:00</start><duration>01:00</duration><room>A001</room><slug>le-libre-en-2017-promouvoir-et-defendre-point-dact</slug><title>Le libre en 2017 : promouvoir et d&#233;fendre, point d'actualit&#233;.</title><subtitle /><track>&#201;ducation</track><type>conference</type><language /><description>Apsr&#232;s quelques rappels des fondamentaux, nous pr&#233;senterons les principaux points d'actualit&#233; sur les dossiers institutionnels autour du logiciel libre en France. Il sera notamment question du contrat "Open Bar Microsoft - la D&#233;fense" sign&#233; sans appel d'offres ni proc&#233;dure publique et contre l'avis des experts militaires. Nous aborderons aussi la politique num&#233;rique du gouvernement et les avanc&#233;es ou reculs institutionnels.</description><links /></event><event id="122"><persons /><person id="95">MATHON Sandrine</person><start>16:30</start><duration>01:00</duration><room>A001</room><slug>donnees-ouvertes-les-conditions-de-reutilisation</slug><title>Donn&#233;es ouvertes : les conditions de r&#233;utilisation</title><subtitle /><track /><type>conference</type><language /><description>La M&#233;tropole de Toulouse, comme l'ensemble des collectivit&#233;s en France a ouvert ses donn&#233;es, et de plus en plus de donn&#233;es publiques vont &#234;tre mises &#224; disposition du fait de la loi pour une R&#233;publique Num&#233;rique d'octobre 2016. Au del&#224; d'un &#233;tat des lieux de l'Open Data en France,  la question se pose pour les r&#233;utilisateurs de bien comprendre les conditions de r&#233;utilisation de ces memes donn&#233;es, en particulier en expliquant les licences de r&#233;utilisation et les droits et contraintes qu'elles g&#233;n&#232;rent.</description><links /></event><event id="211"><persons /><person id="167">M&#233;dard AGBAYAZON</person><start>17:30</start><duration>00:30</duration><room>A001</room><slug>entreprendre-avec-les-logiciels-libres-en-afrique</slug><title>Entreprendre avec les Logiciels Libres en Afrique</title><subtitle /><track /><type>conference</type><language /><description>Ma proposition vise &#224; soutenir le d&#233;veloppement des capacit&#233;s dans les petites et moyennes entreprises africaines dans le secteur du num&#233;rique en vue de cr&#233;er/performer une entreprise autour du logiciel libre. Je partirai de mon cas pratique de cr&#233;
J'aborderai dans un premier temps les mod&#232;les d'entreprises africaines bas&#233;s sur les logiciels libres  en faisant une taxonomie africaine de modeles tels que la s&#233;lection, l'installation; la maintenance, la formation, l'&#233;dition, la certification, ... Apr&#232;s avoir parcouru un certain nombre de pays africains et ayant &#233;tudi&#233; les quelques entreprises sp&#233;cialis&#233;es en logiciel libre, je partagerai les principales conclusions que j'ai tir&#233;es en ressortant la sp&#233;cificit&#233; de chacune de ces entreprises d&#233;couvertes. 
Je finirai mon intervention par les contraintes li&#233;es &#224; la promotion des logiciels libres au B&#233;nin, pour m'&#234;tre engag&#233; depuis plus de 10 ans &#224; promouvoir le libre partout au B&#233;nin avec mon association 'UNIVERSIT&#201; DU LIBRE".
Mon exp&#233;rience m&#233;rite fortement d'&#234;tre partag&#233;.</description><links /></event><room name="A002" /><event id="201"><persons /><person id="162">Mengin Nicolas</person><start>10:30</start><duration>01:00</duration><room>A002</room><slug>comment-jai-transforme-mon-poste-de-developpement-</slug><title>Comment j'ai transform&#233; mon poste de d&#233;veloppement en porte containers.</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Quel d&#233;veloppeur ne s'est jamais arrach&#233; les cheveux lors de l'installation d'un environnement de d&#233;veloppement?
Quel d&#233;veloppeur n'a pas eu un jour &#224; g&#233;rer diff&#233;rentes versions d'une application? Avec plusieurs versions de serveurs d'application, plusieurs SGBD voir plusieurs IDE?
Quel d&#233;veloppeur n'a jamais souhait&#233; tester un produit mais s'est vite confront&#233; &#224; la complexit&#233; de son installation?

Tous ces probl&#232;mes peuvent &#234;tre r&#233;solus gr&#226;ce &#224; un produit : **Docker**.

Utilisateur de l'environnement Docker depuis 3 ans, je propose de montrer comment cela m'aide dans mon quotidien.

Apr&#232;s une pr&#233;sentation de la probl&#233;matique et des diff&#233;rents types d'installations possibles, je proposerai de faire du live-coding sur des exemples pr&#233;cis tir&#233;s de mes exp&#233;riences de d&#233;veloppeur JAVA/J2E, DevOps et d&#233;veloppeur GO :
* Mise en place d'une stack Nginx/JBoss/Postgr&#233;,
* HotDeploy de code Java depuis un IDE (Eclipse) dans un JBoss containeris&#233;.
* Industrialisation de la containerisation des postes de d&#233;veloppement d'un projet J2E.
* Utilisation de Docker dans des Tests d'Int&#233;gration, en GO, n&#233;cessitant des int&#233;ractions avec des syst&#232;mes externes (Tr&#230;fik/Consul/Boulder (Let's Encrypt)).</description><links /></event><event id="223"><persons /><person id="179">Micha&#235;l Pailloncy</person><start>11:30</start><duration>01:00</duration><room>A002</room><slug>throw-new-jenkinspipelinetoomuchcomplexityexceptio</slug><title>throw new JenkinsPipelineTooMuchComplexityException()</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Jenkins Pipeline is probably the most powerful tool provided by the Jenkins community to describe and "execute" your own CI/CD pipeline.
There are two ways to describe it : Scripted and Declarative. Both have their pros and cons but if you don't try to control complexity, both can be very hard and painful to maintain with the time.

During this talk, we'll begin by discussing about the current state of Jenkins and its community, and then provide best practices and advices to keep your Pipeline(s) and CI/CD configuraiton simple, maintainable and testable.
With some practical demos and goodies, of course :-)</description><links /></event><event id="156"><persons /><person id="104">Alexandre Garnier</person><start>15:00</start><duration>01:00</duration><room>A002</room><slug>containers-et-configuration-de-la-promesse-au-conc</slug><title>Containers et configuration: de la promesse au concret avec git et confd</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Docker (et le principe des conteneurs en g&#233;n&#233;ral) est fortement li&#233; &#224; la promesse d&#8217;une image unique qui peut tourner partout et que le m&#234;me artefact peut &#234;tre utilis&#233; sur n&#8217;importe quel environnement &#8220;runtime&#8221; (du poste de d&#233;veloppement jusqu&#8217;en production!) sans avoir &#224; reconstruire une image &#224; chaque fois.

Mais comment atteindre cet objectif de mani&#232;re pratique et efficace tout en &#233;tant capable de conserver l&#8217;historique de la configuration de vos applications sur les diff&#233;rents environnements?

Cette pr&#233;sentation vous propose de voir comment les outils `git` et `confd` peuvent vous aider dans cette mission critique sans perdre la flexibilit&#233; n&#233;cessaire pour que vos devs et vos ops puissent cohabiter sereinement.</description><links /></event><event id="217"><persons /><person id="173">Michael Scherer</person><start>16:30</start><duration>01:00</duration><room>A002</room><slug>de-limportance-davoir-une-infrastructure-ouverte</slug><title>De l'importance d'avoir une infrastructure ouverte</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Un des plus grand b&#233;n&#233;fice du logiciel libre est la r&#233;partition relative et intrinsique du pouvoir entre les mains des membres de la communaut&#233;. N&#233;anmoins, l&#8217;infrastructure, &#233;pine dorsale d'un projet libre, est souvent contr&#244;l&#233; par une poign&#233;e de personnes, une situation qui n'est pas sans causer des soucis d'un point de vue pratique et philosophique.

Gr&#226;ce &#224; la mont&#233;e du mouvement "configuration as code", des grands progr&#232;s ont &#233;t&#233; fait dans ce domaine.

Cette pr&#233;sentation va d'abord expliquer comment les m&#233;thodes modernes peuvent &#234;tre utiliser pour permettre de laisser les coud&#233;s franches &#224; la communaut&#233; et augmenter la transparence sur ce qui arrive au niveau de l'infrastructure, et pourquoi c'est important. 

Puis nous regarderons les objections courantes des administrateurs syst&#232;mes face &#224; ces pratiques et les solutions mises en place pour &#233;viter les probl&#232;mes.</description><links /></event><event id="153"><persons /><person id="121">Mathieu Cinquin</person><start>17:30</start><duration>00:30</duration><room>A002</room><slug>vault-un-gestionnaire-de-secrets-qui-a-du-coffre</slug><title>Vault, un gestionnaire de secrets qui a du coffre</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Avec la mouvance DevOps, les mots de passe sont souvent partag&#233;s entre diff&#233;rentes &#233;quipes et doivent &#234;tre int&#233;gr&#233;s dans des solutions d'automatisation et de d&#233;ploiement/int&#233;gration continu.
Pour &#233;viter le probl&#232;me de Keepass gard&#233; dans un coin par un seul membre de l'&#233;quipe (attention &#224; la jambe cass&#233;e) ou le mot de passe en dur dans un gestionnaire de configuration (??!!???), Vault tire son &#233;pingle du jeu. Et cerise sur le g&#226;teau, Vault propose pleins d'autres fonctionnalit&#233;s pour nous faciliter la vie.</description><links /></event><room name="A201" /><event id="218"><persons /><person id="174">m4dz</person><person id="175">LaPalice</person><start>10:30</start><duration>01:00</duration><room>A201</room><slug>souriez-vous-etes-en-securite-comprendre-les-model</slug><title>Souriez, vous &#234;tes en s&#233;curit&#233; : comprendre les mod&#232;les de menaces</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>&#171; Ne t'en fais pas, c'est "s&#233;curis&#233;". &#187; Vous avez forc&#233;ment d&#233;j&#224; entendu cette phrase. Alors oui, probablement, si on vous le dit, c'est que c'est s&#233;curis&#233;. Mais pour qui ? Comment ? Contre quoi ? Et en quoi &#231;a vous concerne directement ?

C'est toute la question des mod&#232;les de menaces. Vous n'avez pas &#224; vous prot&#233;ger des m&#234;mes intrusions que votre voisin. Vous n'encourez pas les m&#234;mes risques. Vous n'avez ni les m&#234;mes enjeux, ni les m&#234;mes ennemis. Vos mod&#232;les de menaces sont diff&#233;rents, et bien les comprendre est crucial pour bien adapter votre s&#233;curit&#233;.

Petit discussion impromptue mais pas improvis&#233;e entre technique et pratique : les mod&#232;les de menaces, pour qui, pour quoi, et qu'est-ce que &#231;a signifie ? La s&#233;curit&#233;, &#231;a n'existe pas ; ma s&#233;curit&#233;, il faut bien la comprendre.</description><links /></event><event id="54"><persons /><person id="46">Ludovic Hirlimann</person><start>11:30</start><duration>00:30</duration><room>A201</room><slug>comment-securise-son-serveur-introduction-pour-les</slug><title>Comment securiser son serveur, introduction pour les d&#233;butant.</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>Presentation de quelques outils permetant de securise son serveur. Discussion sur de petit principe. Le public cible est un public de d&#233;butant.</description><links /></event><event id="233"><persons /><person id="187">Delphine Malassingne</person><start>12:00</start><duration>00:30</duration><room>A201</room><slug>des-mots-de-passe-aux-petits-oignons</slug><title>Des mots de passe aux petits oignons</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>&#192; l&#8217;heure o&#249; la s&#233;curit&#233; de nos donn&#233;es devient critique, ma&#238;trisons-nous vraiment la base : les mots de passe ? Des crit&#232;res de robustesse &#224; une utilisation pratique et adapt&#233;e, voyons ce qu&#8217;est une gestion de mots de passe aux petits oignons !</description><links /></event><event id="216"><persons /><person id="173">Michael Scherer</person><start>15:00</start><duration>01:00</duration><room>A201</room><slug>securite-du-poste-de-travail-pour-les-contributeur</slug><title>S&#233;curit&#233; du poste de travail pour les contributeurs du libre</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>Firewall, IDS, SELinux, bastion ssh et autres, la liste des mesures de s&#233;curit&#233; du cot&#233; du serveur est longue. Bien qu'un serveur puisse &#234;tre raisonnablement s&#233;curis&#233; de nos jours, on oublie souvent la porte d'entr&#233;e qu'est le poste de travail. Dans cet pr&#233;sentation, nous verrons les divers mesures de s&#233;curit&#233; utilisable sur un poste de travail, et les bonnes pratiques &#224; mettre en place notamment pour les contributeurs de logiciel libre. Bien qu'utilisant la distribution Fedora comme exemple, les id&#233;es sont applicables et transposables &#224; d'autres OS libres</description><links /></event><event id="168"><persons /><person id="135">Christophe JELOYAN</person><start>16:30</start><duration>01:00</duration><room>A201</room><slug>strongswan-a-haute-disponibilite-du-terminal-secur</slug><title>StrongSWAN &#224; haute disponibilit&#233; : du terminal s&#233;curis&#233; au c&#339;ur de r&#233;seau</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>Sigfox d&#233;ploie au travers le monde des stations de base connect&#233;e &#224; leur infrastructure via Internet. Cette connexion doit &#234;tre s&#233;curis&#233;e pour assurer la confidentialit&#233; des &#233;changes. Le standard de fait est IPSEC, et StrongSWAN l&#8217;une des impl&#233;mentations de r&#233;f&#233;rence sur le domaine. Apr&#232;s une &#233;valuation du march&#233; IPSEC (close &amp; open), le choix de Sigfox s&#8217;est port&#233; sur StrongSWAN. Le but de cette session  est de d&#233;crire l&#8217;int&#233;gration de cette brique dans le syst&#232;me embarqu&#233; des stations de base, notamment via le TPM, ainsi que les plugins qui ont d&#251; &#234;tre r&#233;&#233;crit pour g&#233;rer la haute-disponibilit&#233; (fail-over &amp; load-balancing) et les probl&#233;matiques d&#8217;adressages dynamique pour g&#233;rer de dizaines de milliers de tunnels IPSEC simultan&#233;es.</description><links /></event><event id="180"><persons /><person id="144">Martin Gubri</person><start>17:30</start><duration>00:30</duration><room>A201</room><slug>xss-et-logiciel-libre-houston-on-a-un-probleme</slug><title>XSS et logiciel libre : Houston, on a un probl&#232;me</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>L'ouverture du code source est souvent associ&#233;e &#224; une meilleure s&#233;curit&#233; [1]. Mais cette id&#233;e est mise &#224; mal par mon exp&#233;rience : comment un d&#233;butant en s&#233;curit&#233; peut-il trouver, en moins d'un mois, plus de 25 failles de s&#233;curit&#233; dans du logiciel libre ? Un constat est &#224; faire : l'ouverture ne r&#233;pond pas magiquement aux imp&#233;ratifs de s&#233;curit&#233;.
En mars 2017, alors d&#233;butant complet en penetration testing, je me lance dans l'apprentissage des XSS, un type d'attaque contre les applications web. En mettant en pratique ces connaissances, je trouve rapidement et facilement beaucoup de XSS dans des applications web libres (notamment celles que nous h&#233;bergeons &#224; Framasoft). Certaines fonctionnalit&#233;s peu connues des navigateurs web cr&#233;ent les m&#234;mes failles dans de nombreux logiciels.
Cette conf&#233;rence partira du constat que le logiciel libre (tout comme le logiciel propri&#233;taire) est face &#224; un probl&#232;me important : celui de la s&#233;curit&#233;. Nous partagerons ensuite des astuces pour que d'autres d&#233;butants se mettent eux-aussi &#224; chercher et corriger des XSS.
Cette conf&#233;rence s'adresse aux non-d&#233;veloppeurs curieux de la s&#233;curit&#233;, ainsi qu'aux d&#233;velopeurs et mainteneurs qui veulent am&#233;liorer leurs logiciels et leurs pratiques.

[1] https://fr.wikipedia.org/wiki/Logiciel_libre#S.C3.A9curit.C3.A9</description><links /></event><room name="A202" /><event id="235"><persons /><person id="188">Luc Hermitte</person><start>10:30</start><duration>01:00</duration><room>A202</room><slug>application-de-la-programmation-par-contrat-au-c</slug><title>Application de la Programmation par Contrat au C++</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>Apr&#232;s une introduction th&#233;orique &#224; la programmation par contrat, nous essaierons de mieux la cerner en abordant les notions connexes de programmation (excessivement/overly) d&#233;fensive. Nous enchainerons sur une application offensive de la programmation par contrat au C et au C++. Nous d&#233;couvrirons enfin la position du comit&#233; de standardisation du C++ &#224; ce sujet.</description><links /></event><event id="226"><persons /><person id="181">Martin Carton</person><start>11:30</start><duration>00:30</duration><room>A202</room><slug>clippy-un-linter-pour-rust</slug><title>Clippy: Un linter pour Rust</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>Clippy est le linter officiel de Rust.
Qu'il soit novice ou expert, tout d&#233;veloppeur peut commettre des erreurs. Bien que Rust soit un langage s&#251;r, il ne certaines classes d'erreurs, comme par exemple un probl&#232;me de logique.Clippy tente d'adresser ce probl&#232;me et ajoute au compilateur plus de 200 warnings.

Clippy est aussi un projet avec une communaut&#233; active, id&#233;al pour d&#233;buter en Rust.

Cette conf&#233;rence pr&#233;sentera Clippy et le type de probl&#232;mes qu'il peut adresser.</description><links /></event><event id="152"><persons /><person id="120">Fran&#231;ois Royer</person><start>12:00</start><duration>00:30</duration><room>A202</room><slug>introduction-a-clojure-et-clojurescript</slug><title>Introduction &#224; Clojure et Clojurescript</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>Clojure est un langage fonctionnel simple et puissant bas&#233; sur la JVM (et Javascript dans le navigateur). Avec une syntaxe concise et un pedigree de prestige, il permet aux d&#233;veloppeurs d'abstraire rapidement la complexit&#233; d'un domaine pour mieux se concentrer sur le probl&#232;me &#224; r&#233;soudre. Sa communaut&#233; riche et soud&#233;e, ses outils matures, son homog&#233;n&#233;it&#233; en font un outil de choix pour les d&#233;veloppeurs juniors et exp&#233;riment&#233;s - pourquoi pas vous?

Cette session vous pr&#233;sentera les bases du langages puis vous embarquera dans un tour d'horizon de ses capacit&#233;s, en construisant - en live! - une application web complexe.</description><links /></event><event id="225"><persons /><person id="181">Martin Carton</person><start>15:00</start><duration>01:00</duration><room>A202</room><slug>introduction-a-rust</slug><title>Introduction &#224; Rust</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>Rust est un langage cr&#233;&#233; par Mozilla Research pour &#234;tre un langage s&#251;r, concurrent et pratique. C'est un langage compil&#233;, avec peu d'overhead, qui est un rempla&#231;ant moderne &#224; des langages comme C ou C++. Son typage fort et son unique borrow checker permettent d'&#233;viter beaucoup d'erreurs typiques du C ou C++.
Preuve de son succ&#232;s, Rust est aujourd'hui utilis&#233; pour certains composants de Mozilla Firefox.

Cette conf&#233;rence pr&#233;sentera Rust et ses fonctionnalit&#233;s, ses avantages et inconv&#233;nients et son avenir.</description><links /></event><event id="224"><persons /><person id="180">Fr&#233;d&#233;ric Cabestre</person><start>16:30</start><duration>01:00</duration><room>A202</room><slug>regards-sur-la-programmation-fonctionnelle</slug><title>Regards sur la programmation fonctionnelle</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>On dit tout, et souvent n'importe quoi, sur les langages et la programmation fonctionnelle. Souvent accompagn&#233; d'un parfum d'&#233;litisme ou consid&#233;r&#233; peu performant par &#171;bon sens&#187;, je vous propose de jeter un regard diff&#233;rent sur la question, avec la volont&#233; de battre en br&#232;che les id&#233;es re&#231;ues et toucher du doigt les vrais avantages du monde fonctionnel.</description><links /></event><event id="107"><persons /><person id="87">Nicolas Gonzalez</person><start>17:30</start><duration>00:30</duration><room>A202</room><slug>dpdk-librairie-de-traitement-de-paquets-haute-perf</slug><title>DPDK, librairie de traitement de paquets haute-performance</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>Tetaneutral.net est un op&#233;rateur associatif toulousain qui fait parti de la FFDN.
Dans le cadre de cette association, nous &#233;tudions les possibilit&#233;s qu'offre la librairie DPDK afin de concevoir un routeur ou des services anti DDOS par exemple.
Cette pr&#233;sentation est un retour d'&#233;xperience sur ce qu'est et n'est pas DPDK et comment le mettre en oeuvre.</description><links /></event><room name="A203" /><event id="173"><persons /><person id="139">Damien Picard</person><start>11:30</start><duration>01:00</duration><room>A203</room><slug>un-long-metrage-danimation-en-papier-decoupe-dans-</slug><title>Un long-m&#233;trage d'animation en papier d&#233;coup&#233; dans Blender</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>conference</type><language /><description>Le studio d'animation Les F&#233;es Sp&#233;ciales &#224; Montpellier a travaill&#233; durant un an et demi sur le film Dilili &#224; Paris, le prochain film de Michel Ocelot. Ce dernier est connu &#224; l'international pour ses films anim&#233;s en papier d&#233;coup&#233;, notamment Kirikou et Azur et Asmar.
Ses films pr&#233;c&#233;dents, utilisant des techniques de rig 2D, &#233;taient fabriqu&#233;s dans le programme propri&#233;taire Maya. Pour ce nouveau film, plusieurs studios ont collabor&#233; en utilisant diff&#233;rents programme. Une partie cons&#233;quente a &#233;t&#233; faite dans Blender : l'int&#233;gralit&#233; du layout, et l'animation des personnages secondaires et des foules.
Cette &#233;tude de cas se concentrera sur l'int&#233;gration de personnages 2D dans un espace 3D, ainsi que sur les d&#233;veloppement d'outils internes au studio, utilis&#233;s par les riggers et par les animateurs pour les personnages en papier d&#233;coup&#233;.
Le film sortira &#224; la fin 2018.</description><links /></event><event id="136"><persons /><person id="107">Francois Grassard</person><start>15:00</start><duration>01:00</duration><room>A203</room><slug>blender-et-lavenir-du-rendu-en-temps-reel-grace-au</slug><title>Blender et l'avenir du rendu en temps r&#233;el gr&#226;ce au projet EEVEE</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>conference</type><language /><description>Le futur Blender 2.8 sera pourvu d'&#233;normes am&#233;liorations dans bien des domaines, mais l'un des plus marquants pour l'utilisateur final sera sans doute l'int&#233;gration d'un nouveau moteur de rendu dont le nom de code est pour l'instant "EEVEE". Visant &#224; s'approcher des performances de moteurs graphiques tels que l'Unreal Engine ou encore Unity, EEVEE met avant tout l'accent sur le temps r&#233;el, ou du moins une capacit&#233; &#224; pr&#233;senter de mani&#232;re extr&#234;mement fid&#232;le et rapide le rendu que pourra ensuite produire le moteur "Cycles", qui continue de s'am&#233;liorer sans cesse de son cot&#233;.

EEVEE propose donc une nouvelle mani&#232;re de voir le rendu, int&#233;grant l'ajout de Light Probes, de r&#233;flexions et r&#233;fractions via l'utilisation de cubemap, de raytracing  ou de SSR, ajoutant aussi le support du Motion Blur, du Depth of field ou encore des lumi&#232;res volum&#233;triques, le tout en temps r&#233;el directement dans la vue 3D de Blender.

Au del&#224; de consid&#233;rer EEVEE comme un simple outil de prototypage pour Cycles, celui-ci peut rapidement s'imposer comme une arme incroyablement puissance pour les d&#233;partements de lookdev, voir servir de moteur de rendu principal pour une s&#233;rie ou un film d'animation, r&#233;glant partiellement le probl&#232;me des temps de rendu, parfois tr&#232;s lourds.

Il a m&#234;me &#233;t&#233; utilis&#233; il y a quelques semaines pour les animations projet&#233;s sur la sc&#232;ne du groupe de rock fran&#231;ais "Les Insus" (anciennement "T&#233;l&#233;phone"), sur des &#233;crans de 45 m&#232;tres de large, &#224; une r&#233;solution d&#233;passant les 4K et une fr&#233;quence de 50 images/seconde ... une aventure pas toujours simple vu l'&#233;tat de d&#233;veloppement actuel du moteur (entach&#233; pour l'instant de nombreux bugs), mais qui a permis de techniquement r&#233;aliser des prouesses en un temps record.

Cette conf&#233;rence sera l'occasion de d&#233;couvrir les possibilit&#233;s de EEVEE en analysant ce cas d'&#233;cole et les raisons pour lesquelles nous avons opt&#233; pour un rendu OpenGL+EEVEE au sein de la soci&#233;t&#233; D/Labs, en charge de ce projet.</description><links /></event><event id="61"><persons /><person id="50">Nathan Lovato</person><start>16:30</start><duration>01:00</duration><room>A203</room><slug>developpez-des-jeux-video-pros-a-laide-du-libre</slug><title>D&#233;veloppez des jeux vid&#233;o pros... &#224; l'aide du libre!</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>conference</type><language /><description>Vous avez d&#233;j&#224; entendu parler de Gimp, Krita, Blender&#8230; et Godot ? Le moteur de jeux open source que vous attendiez est l&#224;, pr&#234;t &#224; concurrencer les grands de ce monde. 

Que ce soit pour cr&#233;er des jeux d'ordinateur, sur mobiles, en 2D ou en 3D, Godot saura r&#233;pondre &#224; vos attentes. Avec son &#233;diteur complet &#224; la Unity et son support pour de multiples langages, il est accessible tant aux d&#233;veloppeurs qu&#8217;aux designers et aux artistes. Outils d'animation, &#233;diteur de shaders, synchronization du code en live, outils de design d'interface, des meilleurs et j'en passe.

Venez d&#233;couvrir tout cela dans une pr&#233;sentation rythm&#233;e par vos questions!</description><links /></event><event id="210"><persons /><person id="166">Ale Abdo</person><start>17:30</start><duration>00:30</duration><room>A203</room><slug>desentralization-avec-hubzilla-la-plateforme-pour-</slug><title>Desentralization avec Hubzilla: la plateforme pour mettre le web &#224; jour</title><subtitle /><track>Le Libre en g&#233;n&#233;ral</track><type>conference</type><language /><description>Le World Wide Web d'aujourd'hui est plus social (interactive, "2.0") et plus s&#251;re (HTTPS, "let's encrypt") qu'&#224; l'origine. Pourtant, elle manque toujours des instruments essentielles pour distribuer des donn&#233;s et g&#233;rer l'identit&#233; des participants d'une fa&#231;on non-centralis&#233;. &#199;a nous a conduit &#224; une situation o&#249; deux bo&#238;tes majeures d&#233;tiennent le contr&#244;le de-facto des donn&#233;s et identit&#233; de la plupart. Hubzilla est une plateforme r&#233;sultante de plus de 10 ans de recherche sur protocoles f&#233;d&#233;r&#233;s et distribu&#233;s, &#224; travers ses anc&#234;tres Friendica et Redmatrix, et qui nous permet le contr&#244;le d'acc&#232;s distribu&#233; avec &#233;change s&#251;re de donn&#233;s entre serveurs et la pr&#233;sence doubl&#233; dans plusieurs serveurs (protocole Zot), et la g&#233;rance de notre identit&#233; par "web-wide instantaneous single-sign-on" (protocole OpenWebAuth). Sur cette plateforme ils sont d&#233;j&#224; pr&#233;sentes plusieurs applications essentielles, comme r&#233;seau social (plus avanc&#233; que, mais aussi communicant avec Diaspora et Gnusocial dans les limites de ces projets), stockage de fichiers et albums photo, forums et wikis, agenda et calendrier. On vous invite &#224; faire connaissance, devenir membre d'un hub, ou contribuer au progr&#232;s de ce projet unique qui met la web &#224; jour pour surmonter la centralisation et exploitation de notre vie priv&#233;.</description><links /></event><room name="A302" /><event id="94"><persons /><person id="76">Fran&#231;ois Magimel</person><start>10:30</start><duration>00:30</duration><room>A302</room><slug>frets-on-fire-et-son-ecosysteme-apres-11-ans-2</slug><title>Frets On Fire et son &#233;cosyst&#232;me apr&#232;s 11 ans</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Frets On Fire (FoF) est un clone libre du c&#233;l&#232;bre jeu vid&#233;o Guitar Hero. FoF se joue sur ordinateur, est multi-plateforme et l&#233;ger. Ah, oui, au fait, il est &#233;crit en Python.

Cette ann&#233;e, FoF f&#234;te ses 11 ans. C'est l'occasion de revisiter son &#233;cosyst&#232;me et ses technos, montrer ce que l'on peut faire &#224; base de logiciels libres en Python et vous redonner envie d'y jouer.
Ama&#8901;teur&#8901;trice&#8901;s ou pro, transformez votre clavier (ou autre p&#233;riph&#233;rique) en guitare le temps d'un instant !</description><links /></event><event id="109"><persons /><person id="88">Roman Miletitch</person><start>11:00</start><duration>00:30</duration><room>A302</room><slug>drawing-based-gameplay</slug><title>Drawing-based gameplay</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>In this talk, we will share our experience in designing games that revolve around interactive drawings (felt pen on paper, graff on walls, colored syrup on waffles...). How does such games work? A camera captures our drawing, then we analyze it, use that information in our game, and finally project back the rendered game on the drawing to close the loop.

First we will discuss the implications of such an analogical and free-form input in term of user experience and possible gameplays. Then we will present the free and open source tech we have been developing to ease the development process, both software wise (a library, the PTX system) and hardware wise (a kit for easy setup).</description><links /></event><event id="175"><persons /><person id="141">Nicolas Auvray</person><start>11:30</start><duration>00:30</duration><room>A302</room><slug>faire-murir-le-design-dun-jeu-video-libre-et-open-</slug><title>Faire m&#251;rir le design d'un jeu vid&#233;o libre et open-source, 0 A.D.</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Je pr&#233;senterai dans un premier temps 0 A.D., afin de donner au public l'envie de jouer et de parler du jeu, et &#233;ventuellement d'y contribuer.
La seconde partie de la conf&#233;rence portera sur notre nouvelle fa&#231;on de g&#233;rer les propositions de la communaut&#233; concernant le design du jeu (&#233;quilibrage des unit&#233;s, m&#233;caniques de jeu, design technique, ...). Nous avons bataill&#233; avec cette question pendant tr&#232;s longtemps et il a toujours &#233;t&#233; difficile de faire le tri entre les contributions de la communaut&#233; et les commentaires des joueurs et joueuses. Je pr&#233;senterai ces difficult&#233;s, puis, en avant-premi&#232;re au public du Capitole, le syst&#232;me que nous allons mettre en place pour faire avancer le d&#233;veloppement de mani&#232;re constructive.</description><links /></event><event id="145"><persons /><person id="115">Jesse Himmelstein</person><start>12:00</start><duration>00:30</duration><room>A302</room><slug>promouvoir-la-diversite-avec-des-jeux-open-source</slug><title>Promouvoir la diversit&#233; avec des jeux open source</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>La diversit&#233; dans l&#8217;emploi est un d&#233;fi mondial, et l&#8217;Inde ne fait pas exception. Est-ce que les jeux vid&#233;o et des jeux de soci&#233;t&#233; peuvent attaquer &#224; cette probl&#233;matique&#160;complexe ?  Dans le projet IncLudo, le Game Lab du Centre de Recherches Interdisciplinaires (CRI) &#224; Paris s&#8217;associe avec l&#8217;entreprenariat social ZMQ &#224; Delhi pour cr&#233;er, tester, et faire d&#233;couvrir des jeux dans les lieux de travail et au-del&#224;. Pour mettre toutes les chances de notre c&#244;t&#233; et pour encourager le partage, nos jeux sont open source, et nos donn&#233;es ouvertes au public. 

Dans cette conf&#233;rence, Jesse Himmelstein, coordinateur du projet IncLudo, pr&#233;sentera les enjeux de la diversit&#233; dans le monde du travail, comment les jeux peuvent informer et sensibiliser le public, le r&#244;le de l&#8217;open source dans le processus de cr&#233;ation, et nos quatre jeux en cours de production.</description><links /></event><event id="100"><persons /><person id="81">Antoine &#171; vv221/vv222 &#187; Le Gonidec</person><start>15:00</start><duration>01:00</duration><room>A302</room><slug>playit-a-vos-jeux</slug><title>./play.it, &#224; vos jeux !</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>./play.it est un projet n&#233; d&#8217;une remarque que j&#8217;ai trop souvent entendu lorsque je vante les m&#233;rites de nos syst&#232;mes d&#8217;exploitation libres &#224; des amis adepte du jeu vid&#233;o : &#171; Ton linusque l&#224;, c&#8217;est nul, il n&#8217;y a aucun jeu qui tourne dessus&#8239;! &#187;
En simplifiant au maximum l&#8217;installation de jeux vid&#233;os sur GNU/Linux, ./play.it cherche &#224; d&#233;truire cette rumeur qui n&#8217;a aujourd&#8217;hui plus raison d&#8217;&#234;tre.

Ce projet ne se limite pas aux jeux natifs, mais permet aussi d&#8217;utiliser nos distributions pour faire tourner des jeux originellement pr&#233;vus pour Windows ou DOS.

Par sa simplicit&#233; d&#8217;utilisation, ./play.it se propose d&#8217;aider les nouveaux venus sous GNU/Linux &#224; se constituer une ludoth&#232;que suffisamment cons&#233;quente pour que la pratique du dual-boot avec Windows n&#8217;ait plus rien d&#8217;une n&#233;cessit&#233;.</description><links /></event><event id="197"><persons /><person id="158">YannK</person><start>16:30</start><duration>01:00</duration><room>A302</room><slug>le-systeme-de-jeu-chez-khaganat-serveur-client-out</slug><title>Le syst&#232;me de jeu chez Khaganat: serveur, client, outils</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Le projet Khaganat s&#8217;appuie pour son jeu sur un syst&#232;me libre de MMORPG en 3D, Ryzom Core, h&#233;rit&#233; du d&#233;veloppement du jeu Ryzom par le studio Nevrax. Bien que parfois bancal, extr&#234;mement mal document&#233; &#224; l&#8217;origine, il est un des tr&#232;s rares outils enti&#232;rement libres qui offrent une telle plateforme de jeu, avec des services robustes et versatiles et m&#234;me ses outils de cr&#233;ation. Il semblait donc important &#224; l&#8217;&#233;quipe de Khaganat de faciliter l&#8217;usage d&#8217;un tel outil libre, &#224; un moment o&#249; l&#8217;industrie du jeu vid&#233;o prend de plus en plus de place dans notre quotidien.

Depuis l'ann&#233;e derni&#232;re, le projet s'est consacr&#233; surtout au d&#233;ploiement de nouveaux outils pour faciliter la cr&#233;ation du projet. Une refonte totale du syst&#232;me est en cours.

Cette conf&#233;rence propose de pr&#233;senter l&#8217;architecture globale, de voir le fonctionnement d'un client et les options retenues pour mettre en place de nouveaux outils plus faciles &#224; prendre en main.

Le projet Khaganat : https://khaganat.net</description><links /></event><event id="166"><persons /><person id="133">stephane de labrusse</person><start>17:30</start><duration>00:30</duration><room>A302</room><slug>la-meteore-nethserver</slug><title>La m&#233;t&#233;ore NethServer</title><subtitle /><track>Syst&#232;mes</track><type>conference</type><language /><description>NethServer est un syst&#232;me d'exploitation orient&#233; serveur (bas&#233; sur Centos), con&#231;u pour les petites et moyennes entreprises.

Son ADN est d&#8217;&#233;viter la configuration du syst&#232;me par le terminal, ce qui permet de diminuer le co&#251;t global d'apprentissage. La conf&#233;rence sera un tour des fonctionnalit&#233;s, modules et une pr&#233;sentation de la jeune et brillante communaut&#233;.</description><links /></event><room name="A303" /><event id="141"><persons /><person id="111">Levieux Cedric</person><person id="112">Relf</person><start>10:30</start><duration>01:00</duration><room>A303</room><slug>congressus-reunion-et-prise-de-decision</slug><title>Congressus, R&#233;union et prise de d&#233;cision</title><subtitle /><track>Le Libre en g&#233;n&#233;ral</track><type>conference</type><language /><description>Le Parti Pirate, parti politique qui est en partie issu du web, a cr&#233;&#233; pour ses besoins de prise de d&#233;cision et de gestion des r&#233;unions l'outil "Congressus".
Le but de la conf&#233;rence est de montrer ce que peut faire Congressus dans ce contexte : prise de note, motion et vote (et expliciter en passant un certain nombre de m&#233;canismes de vote), gestion des t&#226;ches.</description><links /></event><event id="190"><persons /><person id="154">K.I.A.Derouiche</person><start>11:30</start><duration>00:30</duration><room>A303</room><slug>le-libre-doit-t-il-domine-lecosysteme-de-linternet</slug><title>Le libre doit t-il domin&#233; l&#8217;&#233;cosyst&#232;me de l&#8217;internet des objets connect&#233;s?</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Dans un futur proche les objets connect&#233;s seront partout dans nos vies quotidiennes. Il est important de s&#8217;approprier les connaissances n&#233;cessaires et suffisantes pour comprendre l&#8217;ampleur de cette nouvelle r&#233;volution num&#233;rique qui changera les fondements de notre vie, notre acc&#232;s et partage &#224; l&#8217;information. Les enjeux des objets connect&#233;s sont de taille notamment pour les pays du sud et les questions li&#233;s &#224; la protection de la vie priv&#233;e. Quels sont les principaux sc&#233;narios et menaces potentiels?. Avons nous besoins de renouveler notre compr&#233;hension du logiciel libre?. Quelles comp&#233;tences sont requises pour formuler des r&#233;ponses en mati&#232;re de production des technologies libres aux besoins de l&#8217;&#233;cosyst&#232;me des IoT?.</description><links /></event><event id="169"><persons /><person id="135">Christophe JELOYAN</person><start>12:00</start><duration>00:30</duration><room>A303</room><slug>integration-de-la-glib-dans-un-systeme-embarque</slug><title>Int&#233;gration de la GLib dans un syst&#232;me embarqu&#233;</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Sigfox d&#233;ploie au travers le monde des stations de base connect&#233;e &#224; leur infrastructure via Internet. Ces machines offres des services divers et vari&#233;s comme la gestion des messages Sigfox, la collecte de donn&#233;es de surveillance, la gestion des auto-tests&#8230;
Cette session pr&#233;sente l&#8217;utilisation de la GLib dans ce contexte purement embarqu&#233; et les avantages tir&#233;s d&#8217;une telle librairie, brique de base du projet GTK+. La gestion de fichier, du parsing de configuration, la gestion du r&#233;seau, la programmation objet et &#233;v&#232;nementielle ou encore l&#8217;impl&#233;mentation de DBus en font partie.</description><links /></event><event id="232"><persons /><person id="186">Florent Revest</person><start>15:00</start><duration>01:00</duration><room>A303</room><slug>bidouiller-sa-montre-connectee-avec-asteroidos</slug><title>Bidouiller sa montre connect&#233;e avec AsteroidOS</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>Cette pr&#233;sentation tournera autour de la personnalisation du syst&#232;me d'exploitation libre pour montres connect&#233;es AsteroidOS. Nous aborderons principalement les technologies OpenEmbedded et QML.

Dans un premier temps nous verrons comment compiler l'OS enti&#232;rement depuis les sources et comment adapter l'image syst&#232;me &#224; ses besoins. Ensuite nous &#233;tudierons la cr&#233;ation d'une application simple pour ce syst&#232;me.</description><links /></event><event id="150"><persons /><person id="119">Pierre FICHEUX</person><start>16:30</start><duration>01:00</duration><room>A303</room><slug>systemes-dexploitations-libres-pour-liot-linuxyoct</slug><title>Syst&#232;mes d'exploitation libres pour l'IoT (Linux/Yocto et Contiki)</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Le but de la conf&#233;rence est de pr&#233;senter les technologies libres utilis&#233;es pour l'IoT dans le cadre de capteurs plus ou moins l&#233;gers (SoC Cortex-A  et  Cortex-M). Nous &#233;voquerons l&#8217;utilisation de Yocto puis de l&#8217;OS Contiki en &#233;voquant les avantages et inconv&#233;nients des deux approches. 
- cr&#233;ation d&#8217;une distribution sous Yocto pour un capteur de temp&#233;rature sur bus I&#178;C (utilisation du Wi-Fi, MQTT, etc.) sur une cible Rasberry Pi.
-application sous Contiki pour l&#8217;acc&#232;s au service IFTTT (If This Then That) sur une cible SensorTag de TI. Utilisation du projet &#171;&#160;border router&#160;&#187; 6LBR.

La pr&#233;sentation sera suivie de d&#233;monstrations.

R&#233;f&#233;rences&#160;:

https://www.yoctoproject.org/ecosystem/iot
http://contiki-os.org/
http://cetic.github.io/6lbr/
https://ifttt.com/discover</description><links /></event><event id="106"><persons /><person id="87">Nicolas Gonzalez</person><start>17:30</start><duration>00:30</duration><room>A303</room><slug>liberez-vos-objets-avec-lorawan</slug><title>Lib&#233;rez vos objets avec LoRaWAN</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>L&#8217;av&#232;nement de l'Internet des Objets est pouss&#233; par l&#8217;&#233;mergence de nombreuses technologies et protocoles.
LoRaWAN est une technologie tr&#232;s appr&#233;ci&#233; de la communaut&#233; libriste car il est possible de construire toute une infrastructure du capteur au cloud avec du logiciel et mat&#233;riel ouvert.
Nous pr&#233;senterons les diff&#233;rentes briques &#224; mettre en &#339;uvre afin de cr&#233;er un r&#233;seau d'objets pour la maison ou l'entreprise.</description><links /></event><room name="B00" /><event id="236"><persons /><person id="189">Capitole du Libre</person><start>10:00</start><duration>00:30</duration><room>B00</room><slug>accueil-2</slug><title>Accueil</title><subtitle /><track /><type>keynote</type><language /><description>Bienvenue au Capitole du Libre 2017!</description><links /></event><event id="231"><persons /><person id="185">Kevin Ottens</person><start>11:30</start><duration>01:00</duration><room>B00</room><slug>le-non-dit-de-la-developer-story-etude-de-cas-dans</slug><title>Le non-dit de la &#171;Developer Story&#187; -- Etude de cas dans la communaut&#233; KDE et solutions</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Apr&#232;s des ann&#233;es &#224; organiser des projets &#233;tudiants &#224; l'Universit&#233; de Toulouse,
il est temps de se rendre&#160;&#224; l'&#233;vidence... les coutumes de certaines communaut&#233;s
historiques ne sont pas toujours compatibles avec les attentes des &#233;tudiants
pour se lancer. Nous avons des technologies int&#233;ressantes mais souvent les
pr&#233;requis pour faire un premier patch pour une application de bureau peuvent
faire peur aux d&#233;butants.

De plus, les attentes du d&#233;veloppeur b&#233;n&#233;vole ont aussi &#233;volu&#233;es ces derni&#232;res
ann&#233;es. Il est souvent moins motiv&#233; pour se battre avec des syst&#232;mes de build...
et pourtant ils auraient s&#251;rement des choses int&#233;ressantes &#224; contribuer &#224; nos
applications.

Le but de cette pr&#233;sentation est de montrer les difficult&#233;s techniques que nous
avons tendance &#224; installer sur le chemin des nouveaux contributeurs en prenant
comme exemple la communaut&#233; KDE. Nous verrons les diff&#233;rentes &#171;Developer Stories&#187;
pr&#233;sent&#233;es par cette communaut&#233; et insisterons sur leurs d&#233;fauts. Nous regarderons
aussi les solutions utilis&#233;es par d'autres &#233;cosyst&#232;mes pour des probl&#232;mes
similaires. Avec ces informations, nous pr&#233;senterons la &#171;developer story&#187; id&#233;ale
que nous devrions tous chercher &#224; atteindre sur nos projets.</description><links /></event><event id="147"><persons /><person id="117">Tristan Nitot</person><start>14:00</start><duration>01:00</duration><room>B00</room><slug>le-numerique-libre-a-lere-du-cloud-faut-il-se-resi</slug><title>Le num&#233;rique Libre &#224; l'&#232;re du Cloud : faut-il se r&#233;signer &#224; vivre dans l'&#233;co-syst&#232;me Google ?</title><subtitle /><track /><type>conference</type><language /><description>Avec l'av&#232;nement du SaaS (Software as a Service), du Cloud et du smartphone, quelle place reste-t-il au logiciel libre et &#224; la bidouille ? Peut-on esp&#233;rer r&#233;pandre le libre aupr&#232;s de tous alors que Google et Facebook semble rafler la mise ? &#192; quoi pourrait ressembler un Cloud libre pour tous ? Faut-il vraiment s'inqui&#233;ter d'une h&#233;g&#233;monie des GAFAMs alors que nous n'avons rien &#224; cacher ? Voici les r&#233;ponses auxquelles Tristan Nitot va r&#233;pondre lors d'une conf&#233;rence qui a des vrais morceaux de cochons dedans.</description><links /></event><event id="119"><persons /><person id="92">Jean-Baptiste Kempf</person><start>15:00</start><duration>01:00</duration><room>B00</room><slug>vlc-30</slug><title>VLC 3.0</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>conference</type><language /><description>The next major version of VLC should be released between now and CdL2017.

It will feature a lot of new formats and improve a lot the performance.

This talk will explain a bit the story of VLC and focus on what is new in 3.0 and what will come later on.</description><links /></event><event id="137"><persons /><person id="108">Pouhiou</person><start>16:30</start><duration>01:00</duration><room>B00</room><slug>framasoft-ne-soyons-pas-serieux</slug><title>Framasoft : ne soyons pas s&#233;rieux</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Et si ne pas &#234;tre s&#233;rieux &#233;tait une proposition politique ?
Durant 3 ans, l'association Framasoft a travaill&#233; le plus s&#233;rieusement du monde sur le projet "D&#233;googlisons Internet". Cette micro-association (35 membres, 7 salari&#233;&#183;e&#183;s) propose d&#233;sormais 30 services alternatifs &#224; ceux des g&#233;ants du web utilis&#233;s par des centaines de milliers de personnes chaque mois.
Je vous propose un tour dans les coulisses de l'association, pour voir comment le fait de ne pas trop se prendre au s&#233;rieux a &#233;t&#233; un des &#233;l&#233;ments cl&#233;s de cette r&#233;ussite.</description><links /></event><event id="239"><persons /><person id="190">Adrien Blind</person><start>17:30</start><duration>01:00</duration><room>B00</room><slug>skynet-vs-planet-of-the-apes-duel</slug><title>Skynet vs Planet of The Apes, Duel!</title><subtitle /><track>WTF</track><type>conference</type><language /><description>Two self-managed Docker clusters deployed on public clouds and fight each other in a ruthless battle. One has been designed to resist any form of threat. The other one's only aim is to destroy the first one. Who's going to win?

Through this fantasy, we'll first cover all the technologies concretely used to set up the platforms and run the battle (linuxkit, infrakit, &amp; swarm mode, and even raspberry devices among others), while we'll step back in the second part to address the subsequent architecture stakes involved : reliability, scalability, edge computing, immutability, micro-services, hybridation, distributed storage will hold no secret for you ! Most of all, you'll understand the importance of the synergies implied between the platform's and the app's design to achieve such a result.</description><links /></event><event id="237"><persons /><person id="189">Capitole du Libre</person><start>18:30</start><duration>01:00</duration><room>B00</room><slug>la-place-de-lopen-source-dasn-la-societe</slug><title>La place de l'Open Source dans la soci&#233;t&#233;</title><subtitle /><track /><type>keynote</type><language /><description>Table ronde</description><links /></event><room name="B207" /><event id="222"><persons /><person id="178">S&#233;bastien DA ROCHA</person><start>14:00</start><duration>02:00</duration><room>B207</room><slug>initiation-a-ansible-2</slug><title>Initiation &#224; Ansible</title><subtitle /><track>DevOps</track><type>atelier</type><language /><description>Nous allons &#233;crire un petit playbook pour voir quelques actions de base. Puis nous allons faire un playbook pour installer et configurer un serveur web NG1NX

Puis cr&#233;er un r&#244;le, pour &#233;viter de faire des usines &#224; gaz.

Nous allons regarder comment r&#233;aliser un template en utilisant des facts.

Pour terminer un petit topo sur les inventaires, comment utiliser des variables et quelques perspectives.

Pr&#233;requis:
- Avoir install&#233; Ansible 2.3 ou 2.4 (http://docs.ansible.com/ansible/latest/intro_installation.html#installing-the-control-machine)
- Avoir un PC sous Linux, *BSD ou MacOS X &#224; la limite
- Recommand&#233; : avoir une ou deux machines virtuelles accessible en ssh install&#233;es avec un user qui a les droits d'admin (su ou sudo)</description><links /></event><event id="108"><persons /><person id="88">Roman Miletitch</person><start>16:30</start><duration>02:00</duration><room>B207</room><slug>designing-a-game-based-on-drawing</slug><title>Designing a game based on drawing</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>atelier</type><language /><description>In this atelier, we will use the PTX system to grant life to your drawings! From simple to more complex projects, you will discover the PTX library, an open source library that scan, give simple information about drawings and allow for easy projection on top of it.

Armed with felt pen, paper, camera and video projector, we'll use our time together to prototype projects. Digital art, innovative gameplay, weird experiments... you'll be the one to chose and to code, for everybody to draw and interact with it!</description><links /></event><room name="B208" /><event id="115"><persons /><person id="91">Elzen</person><start>14:00</start><duration>02:00</duration><room>B208</room><slug>bidouiller-son-environnement</slug><title>Bidouiller son environnement&#160;!</title><subtitle /><track /><type>atelier</type><language /><description>GNOME (-Shell, Unity, Cinnamon), KDE, Xfce, LXDE, GNUstep, Enlightenment, etc.&#8239;: le monde libre propose de nombreux environnements graphiques possibles, pour s'adapter &#224; tous les go&#251;ts. Vraiment tous&#160;? Oui, vraiment tous&#160;: les gens qui ne seraient pas satisfait disposent encore de plein d'outils pour se bricoler leur environnement sur mesure.
Au cours de cet atelier, nous aborderons de quelques uns de ces outils, des plus utiles (gestionnaires de fen&#234;tres, docks et panels en tous genres) aux plus indispensables (un chat qui suit la souris et autres animations inutiles). Mais, surtout, nous aborderons la fa&#231;on dont on peut se faire des scripts sur mesure pour compl&#233;ter ce qui manquerait encore.
Nous pourrons ainsi voir comment se cr&#233;er une session X personnalis&#233;e pour lancer un environnement fait maison, mais &#233;galement comment contr&#244;ler les applications &#224; l'aide d'une manette, &#7431;&#769;&#7428;&#640;&#618;&#640;&#7431; &#7429;&#618;&#640;&#7431;&#7428;&#7451;&#7431;&#7437;&#7431;&#628;&#7451; &#7431;&#628; &#7448;&#7431;&#7451;&#618;&#7451;&#7431;&#42801; &#7428;&#7424;&#7448;&#618;&#7451;&#7424;&#671;&#7431;&#42801; (et autres bidouilles int&#233;ressantes autour du clavier), passer certaines fen&#234;tres en n&#233;gatif, ou encore lancer des scripts arbitraires en fonction de la fen&#234;tre active. Plein de possibilit&#233;s&#8230; et ce n'est m&#234;me pas si compliqu&#233;&#160;!</description><links /></event><event id="139"><persons /><person id="109">Naomi Testard</person><person id="110">Axel Viala</person><start>16:30</start><duration>02:00</duration><room>B208</room><slug>initiation-a-la-programmation-fonctionnelle-avec-o</slug><title>Initiation &#224; la programmation fonctionnelle avec OCaml</title><subtitle /><track>D&#233;veloppement</track><type>atelier</type><language /><description>Cet atelier est une initiation &#224; la programmation pour grands d&#233;butants en utilisant le langage OCaml. OCaml est un langage g&#233;n&#233;raliste, pragmatique, fonctionnel, imp&#233;ratif, et objet qui permet de r&#233;aliser des programmes vari&#233;s de fa&#231;on simple et expressive (web, syst&#232;me, client-serveur, etc.). Cet atelier ne n&#233;cessite aucune connaissance pr&#233;alable de la programmation et les notions abord&#233;es peuvent &#234;tre appliqu&#233;es &#224; d'autres langages (JavaScript, Java, Rust, Python&#8230;).</description><links /></event><room name="B306" /><event id="183"><persons /><person id="147">David Revoy</person><start>14:00</start><duration>02:00</duration><room>B306</room><slug>creer-sa-bdmanga-avec-krita</slug><title>Cr&#233;er sa B.D/Manga avec Krita</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>atelier</type><language /><description>Un atelier qui guidera ses participant(e)s &#224; cr&#233;er une case de BD/Manga de A &#224; Z avec le logiciel Krita. Une d&#233;couverte pratique des fonctionnalit&#233;s de Krita au travers de cinq &#233;tapes: croquis, encrage, lettrage, colorisation, et effets. Ouvert &#224; tout niveaux et pour touts &#226;ges. (L'atelier n&#233;cessite que vous apportiez vos ordinateurs et tablette graphique.)</description><links /></event><event id="116"><persons /><person id="91">Elzen</person><start>16:30</start><duration>02:00</duration><room>B306</room><slug>creer-sa-campagne-pour-battle-for-wesnoth</slug><title>Cr&#233;er sa campagne pour Battle for Wesnoth&#160;!</title><subtitle /><track>Jeux Libres</track><type>atelier</type><language /><description>Jouer, c'est bien&#160;; faire jouer, ce n'est pas mal non plus. Battle for Wesnoth, l'un des fleurons du jeu vid&#233;o libre, peut &#234;tre assez simplement enrichi par des contributions d'utilisateur, alors pourquoi ne pas essayer de cr&#233;er vos propres campagnes&#160;? Nous verrons ensemble tout ce qu'il faut pour cr&#233;er le n&#233;cessaire pour pr&#233;parer de longues heures de jeu suppl&#233;mentaire.

Afin de gagner du temps et de pouvoir aborder des points plus avanc&#233;s, comme la cr&#233;ation d'unit&#233;s personnalis&#233;es ou la gestion des &#233;v&#233;nements, n'h&#233;sitez pas &#224; consulter, avant l'atelier, ce petit tutoriel (r&#233;alis&#233; suite &#224; un atelier d'un pr&#233;c&#233;dent Capitole du Libre) qui pose les bases de la cr&#233;ation de campagne&#8239;:

http://fadrienn.irlnc.org/galeries/tutoriels/creer_sa_campagne_wesnoth/

Mais, naturellement, nous pourrons aussi reprendre &#231;a sur place s'il y a besoin :-)</description><links /></event><room name="B307" /><event id="159"><persons /><person id="119">Pierre FICHEUX</person><start>14:00</start><duration>02:00</duration><room>B307</room><slug>creation-dun-capteur-iot-sous-yocto</slug><title>Cr&#233;ation d'un Capteur "IoT" sous Yocto</title><subtitle /><track>IoT et Embarqu&#233;</track><type>atelier</type><language /><description>- Introduction &#224; Yocto

- Construction d'un capteur (&#224; base de Raspberry Pi) simulant un compteur &#233;lectrique &#8220;connect&#233;&#8221;. Le syst&#232;me d'exploitation utilis&#233; est Linux (produit par l'outil Yocto)

- Envoi des trames (au format JSON) par MQTT vers iot.eclipse.org

- Visualisation des donn&#233;es par l'application mobile Android &#8220;Eneargy&#8221; (que les stagiaires pourront installer)</description><links /></event><event id="160"><persons /><person id="126">syl</person><start>16:30</start><duration>02:00</duration><room>B307</room><slug>initiation-a-tor-et-tails</slug><title>Initiation &#224; Tor et Tails</title><subtitle /><track>R&#233;seaux</track><type>atelier</type><language /><description>Cet atelier sera l'occasion de comprendre pourquoi utiliser Tor, de d&#233;couvrir son fonctionnement puis de voir les diff&#233;rentes fa&#231;on de l'utiliser, notamment gr&#226;ce &#224; Tails.

https://www.torproject.org/ https://tails.boum.org/</description><links /></event><room name="B308" /><event id="134"><persons /><person id="106">Yann Le Doar&#233;</person><start>14:00</start><duration>02:00</duration><room>B308</room><slug>yourdistrofromscrach</slug><title>YourDistroFromScrach</title><subtitle /><track>Syst&#232;mes</track><type>atelier</type><language /><description>Vous &#234;tes curieux de pouvoir r&#233;aliser votre propre distribution ?

Cet atelier vous expliquera comment r&#233;aliser sa propre distribution, avec l'outil "YourDistroFromScratch"

- Choix de la cible (PC 32/PC 64/Raspberry)
- Choix du noyau
- Configuration du noyau
- Choix des logiciels &#224; utiliser
- Pouvoir installer des logiciels tiers/ des paquets d'autres distributions</description><links /></event><room name="C002" /><event id="187"><persons /><person id="152">Sylvain Steer</person><person id="172">OKhin</person><start>10:30</start><duration>01:00</duration><room>C002</room><slug>logiciel-libre-services-ethiques-se-liberer-du-tro</slug><title>Logiciel libre, services &#233;thiques se lib&#233;rer du trou noir publicitaire</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>Dans la continuit&#233; d'une conf&#233;rence donn&#233;e &#224; PSES (Publicit&#233; et surveillance publicitaire en ligne, un combat &#224; gagner), cette conf&#233;rence a pour objectif de relever les incoh&#233;rences entre des volont&#233;s de proposer des services commerciaux &#233;thiques en ligne et de d&#233;velopper des logiciels libres dans des approches de respect des libert&#233;s des utilisateurs tout en ayant recours &#224; un financement principalement publicitaire sans rechercher une voie r&#233;ellement plus &#233;thique.

S'il est tr&#232;s difficile de sortir du "p&#234;ch&#233; originel" d'Internet et de l'apparence du gratuit, la communaut&#233; du logiciel libre et de la d&#233;fense des libert&#233;s num&#233;riques a un r&#244;le important &#224; jouer (et certains exemples positifs l'ont bien compris) pour rechercher d'autres solutions et arr&#234;ter de fonctionner sur l'exploitation des utilisateurs et utilisatrices.</description><links /></event><event id="207"><persons /><person id="164">Bram</person><start>11:30</start><duration>01:00</duration><room>C002</room><slug>yunohost-vers-lauto-hebergement-et-au-dela</slug><title>YunoHost : vers l'auto-h&#233;bergement et au-del&#224;</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>10 ans apr&#232;s "Internet Libre ou minitel 2.0" et dans un Internet de plus en plus centralis&#233;, YunoHost, commenc&#233; comme une solution pour auto-h&#233;berger plus facilement ses e-mails, devient progressivement une des pierres angulaires parmi les organisations et&#160;les outils &#339;uvrant &#224; un Internet plus libre, plus neutre et plus d&#233;centralis&#233;.

Depuis ses origines, YunoHost est un outil de d&#233;mocratisation de l'administration syst&#232;me et donc de l'auto-h&#233;bergement. YunoHost a permis &#224; la Brique Internet (solution d'auto-h&#233;bergement &#224; domicile) de voir le jour, ainsi qu'&#224; certains des CHATONS (h&#233;bergeurs associatifs locaux) de se lancer. YunoHost commence d&#233;sormais &#233;galement &#224; &#234;tre utilis&#233; par des petites organisations pas forc&#233;ment sp&#233;cialis&#233;es dans l'informatique.

Cette conf&#233;rence vous pr&#233;sentera pourquoi nous pensons que YunoHost, en tant qu'outil destin&#233; &#224; un public non-expert, est aujourd'hui un composant important pour un Internet plus neutre et plus d&#233;centralis&#233;. Nous vous pr&#233;senterons aussi comment marche YunoHost (son architecture, son interface, son &#233;cosyst&#232;me d'applications), les perspectives au-del&#224; du simple &#171; auto-h&#233;bergement pour tous &#187; (notamment les questions de f&#233;d&#233;ration) et&#160; comment nous rejoindre pour faire partie de cette merveilleuse aventure !</description><links /></event><event id="219"><persons /><person id="174">m4dz</person><start>15:00</start><duration>01:00</duration><room>C002</room><slug>privacy-by-design</slug><title>Privacy by design</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>Surgissant du pass&#233;, le concept de Privacy by Design devient populaire aupr&#232;s des startups qui s'empressent de s'estampiller "Privacy compliant". Mais prot&#233;ger les donn&#233;es des utilisateurs, &#231;a signifie quoi concr&#232;tement ? Quelles sont les mesures et les concepts n&#233;cessaires &#224; la mise en place d'un service r&#233;ellement Privacy by Design ? Quels sont les cons&#233;quences techniques et les pi&#232;ges &#224; &#233;viter pour ne pas sombrer dans une formule creuse ? Comment l'&#233;cosyst&#232;me Open Source peut-il, par nature, fournir les &#233;l&#233;ments essentiels &#224; la protection de la vie priv&#233;e de nos utilisateurs ?

De 1978 &#224; aujourd'hui, voyons comment mettre en place une strat&#233;gie Privacy by Design, bas&#233;e sur des solutions Open Source, r&#233;ellement efficace.</description><links /></event><event id="69"><persons /><person id="55">Genma</person><start>16:30</start><duration>01:00</duration><room>C002</room><slug>du-pseudonymat-au-pseudonyme-retour-dexperience</slug><title>Du pseudonymat au pseudonyme, retour d'exp&#233;rience</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>R&#233;sum&#233; :
T&#233;moignage et retour d'exp&#233;rience sur mon passage du pseudonymat au pseudonyme, et les cons&#233;quences que &#231;a sur ma vie de tous les jours.

Pendant pr&#232;s de 15 ans, depuis mes d&#233;buts sur Internet, j'ai toujours fait de la gestion de mon identit&#233; num&#233;rique, s&#233;parant mon identit&#233; civile, J&#233;r&#244;me, de mon identit&#233; num&#233;rique, Genma, sous laquelle je tiens un blog. Ce pseudonymat a &#233;t&#233; maintenu malgr&#233; une activit&#233; publique plus importante au travers de diff&#233;rentes participations &#224; des &#233;v&#233;nements et des conf&#233;rences, m&#234;me si l&#8217;&#233;tanch&#233;it&#233; entre ces deux identit&#233;s &#233;tait assez poreuse... Avec mon nouvel emploi, le choix d'outer ce pseudonymat et de passer au pseudonyme a &#233;t&#233; fait? Pourquoi? Dans quel but? Quelles cons&#233;quences sur ma vie professionnelle, le fait que mon employeur sache que je suis Genma?

Le tout sur fond de retour d'exp&#233;rience avec des r&#233;ponses &#224; des questions tells que quels sont les pi&#232;ges rencontr&#233;s et &#224; &#233;viter dans le cadre du pseudonymat? Ou encore en quoi le pseudonymat est-il diff&#233;rent de l'anonymat et du pseudonyme?</description><links /></event><event id="103"><persons /><person id="83">Loic Dachary</person><start>17:30</start><duration>00:30</duration><room>C002</room><slug>securedrop-pour-lanonymat-des-sources</slug><title>SecureDrop pour l'anonymat des sources</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>SecureDrop est une plateforme Logiciel Libre pour lanceurs d'alerte d&#233;velopp&#233; par l'association Freedom of the Press Foundation. Elle a re&#231;u le Free Software Awards 2016 de la Free Software Foundation pour son utilit&#233; sociale. Son &#233;volution repose sur les efforts d'une communaut&#233; qui doit se renforcer pour r&#233;pondre aux d&#233;fis lanc&#233;s par la surveillance de masse. Developpeurs, formateurs et traducteurs sont encourag&#233;s &#224; participer afin que les journalistes d'investigation parviennent &#224; pr&#233;server l'anonymat de leur sources. Les soci&#233;t&#233;s de service en informatique ne sont pas attir&#233;es par ce march&#233; trop peu lucratif. C'est &#224; nous, individus, de nous mobiliser pour faire exister les outils dont les d&#233;fendeurs de la libert&#233; de la presse ont besoin.</description><links /></event></day><day date="2017-11-19" index="2"><room name="A001" /><event id="165"><persons /><person id="132">Denis Dordoigne</person><start>10:30</start><duration>01:00</duration><room>A001</room><slug>demystifier-le-travail-dhebergeur</slug><title>D&#233;mystifier le travail d'h&#233;bergeur</title><subtitle /><track>Syst&#232;mes</track><type>conference</type><language /><description>Beaucoup d'initiatives sont d&#233;j&#224; alternatives, transparentes, ouvertes, neutres et solidaires, mais peu osent rejoindre un collectif d'h&#233;bergeurs, par crainte de l'engagement que cela implique. En quelques dizaines de minutes, on va expliquer ce qu'est un h&#233;bergeur, comment il peut annoncer des taux de disponibilit&#233; proches de 100%, quels-sont les concepts-cl&#233;s du m&#233;tier et le vocabulaire particulier... tout cela sans avoir &#224; aborder les d&#233;tails techniques.</description><links /></event><event id="110"><persons /><person id="89">taziden</person><start>11:30</start><duration>01:00</duration><room>A001</room><slug>internet-libre-en-correze-du-champ-a-lassiette</slug><title>Internet Libre en Corr&#232;ze, du champ &#224; l'assiette</title><subtitle /><track>Le Libre en g&#233;n&#233;ral</track><type>conference</type><language /><description>L'objectif de cette conf&#233;rence est de pr&#233;senter l'&#233;volution d'un fournisseur d'acc&#232;s &#224; Internet associatif, Ilico (Internet Libre en Corr&#232;ze) depuis sa cr&#233;ation en 2010 dans le cadre de l'essaimage initi&#233; par FDN jusqu'&#224; aujourd'hui.

Tout comme Tetaneutral &#224; Toulouse, Ilico existe depuis 2010 et fait partie des assos fondatrices de la F&#233;d&#233;ration des fournisseurs d'acc&#232;s &#224; Internet associatifs.
Se basant au d&#233;part sur l'infrastructure de l'asso FDN, Ilico a petit &#224; petit pris son ind&#233;pendance notamment via des structures de mutualisation comme les op&#233;rateurs Gitoyen et Grenode.

La conf&#233;rence a pour objectif de montrer l'&#233;cosyst&#232;me autour de l'acc&#232;s &#224; Internet associatif, avec &#224; la fois un accent sur la partie technique (logiciel libre, documentation en ligne, etc) et sur la partie organisationnelle : comment faire vivre et fonctionner de mani&#232;re efficace un groupe de gens sur le long terme.

NB : 
Gitoyen est l'association fournissant les IP d'Ilico.
Grenode est l'association au sein de laquelle Ilico mutualise une infrastructure r&#233;seau avec d'autres associations (FAI, h&#233;bergeurs, etc).</description><links /></event><event id="47"><persons /><person id="44">piquereau</person><start>14:00</start><duration>01:00</duration><room>A001</room><slug>un-aeronef-sous-licence-libre-mais-pour-quoi-faire</slug><title>Un a&#233;ronef sous licence libre, mais pour quoi faire ?</title><subtitle /><track>Le Libre en g&#233;n&#233;ral</track><type>conference</type><language /><description>Lors de cette conf&#233;rence d&#233;bat, apr&#232;s la pr&#233;sentation d&#8217;un projet r&#233;el d&#8217;a&#233;ronef et surtout de son contexte socio-&#233;conomique, nous nous poserons la question de l&#8217;int&#233;r&#234;t de passer ce projet sous une licence libre. A l&#8217;instar de Linux ou d&#8217;OpenOffice et du succ&#232;s qu&#8217;ils ont eu du fait de passer sous une licence libre, cela pourrait-il s&#8217;appliquer &#224; un a&#233;ronef ?
Cette conf&#233;rence qui mixe l'a&#233;ronautique et le libre devrait int&#233;resser le public toulousain a&#233;ronautique et libriste.</description><links /></event><event id="203"><persons /><person id="163">Thierry Stoehr</person><start>15:00</start><duration>01:00</duration><room>A001</room><slug>les-formats-ouverts-encore-et-toujours</slug><title>Les formats ouverts, encore et toujours !</title><subtitle /><track>&#201;ducation</track><type>conference</type><language /><description>L'importance des formats ouverts demeure primordiale dans le monde num&#233;rique actuel. Un tour d'horizon des situation,s des enjeux et des solutions.</description><links /></event><room name="A002" /><event id="229"><persons /><person id="184">Adrien Cunin</person><start>10:30</start><duration>01:00</duration><room>A002</room><slug>administrer-son-cloud-openstack-avec-la-communaute</slug><title>Administrer son cloud OpenStack, avec la communaut&#233; !</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Pr&#233;sentation &#224; destination des actuels et futurs administrateurs de cloud OpenStack ; nous nous focaliserons sur ce qu'un tel r&#244;le implique en terme d'interactions avec la communaut&#233; OpenStack.

En quoi est-ce que l'aspect open source d'OpenStack est un &#233;l&#233;ment fondamental &#224; prendre en compte lorsqu'on est en charge de la gestion d'un cloud OpenStack ? Quels outils sont en jeu du c&#244;t&#233; de la communaut&#233; ? Comment garder son d&#233;ploiement OpenStack proche du code upstream tout en pouvant y appliquer certaines modifications ?</description><links /></event><event id="174"><persons /><person id="140">Hadrien TOMA</person><start>11:30</start><duration>01:00</duration><room>A002</room><slug>un-exemple-de-gestion-dinfrastructure-electronique</slug><title>Un exemple de gestion d'infrastructure &#233;lectronique, &#224; la maison!</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Dans cette pr&#233;sentation, nous &#233;tudierons un exemple de gestion d'infrastructure &#233;lectronique personnelle faisant exclusivement intervenir des technologies OpenSources. L'objectif est de donner un aper&#231;u des capacit&#233;s que permettent les logiciels libres &#224; tout un chacun, en entreprise, mais aussi &#224; la maison!

## Des fonctionnalit&#233;s qui seront abord&#233;es :
* Contr&#244;le
* Modularit&#233;
* Reproductibilit&#233;
* R&#233;silience
* S&#233;curit&#233;
* Surveillance</description><links /></event><event id="144"><persons /><person id="113">Antoine CAVARD</person><person id="114">Cedric BONHOMME</person><start>14:00</start><duration>00:30</duration><room>A002</room><slug>deployez-des-applications-auto-hebergees-avec-ansi</slug><title>D&#233;ployez des applications auto-h&#233;berg&#233;es avec Ansible &amp; Docker.</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Cette session s&#8217;adresse &#224; tous ceux qui connaissent les commandes de base sous GNU/Linux.

A partir de notre exp&#233;rience, nous pr&#233;senterons un cas concret :
Le d&#233;ploiement de Rocket.chat une messagerie instantan&#233;e et Hugo un g&#233;n&#233;rateur de site statique au moyen d'Ansible et Docker.

A la fin de cette session vous aurez les connaissances n&#233;cessaires sur Ansible et Docker pour avoir le contr&#244;le et la responsabilit&#233; des donn&#233;es de vos applications pr&#233;f&#233;r&#233;es.</description><links /></event><event id="198"><persons /><person id="159">John Samuel</person><start>14:30</start><duration>00:30</duration><room>A002</room><slug>rethinking-the-command-line</slug><title>Rethinking the command-line</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Command-line interface is one of the oldest, yet commonly used human-computer interface, where users type textual commands with arguments to get desired results. Developers often provide command-line options for software applications along with graphical user interface. Several programming languages provide standard libraries to help programmers parse and handle command-line arguments. However, both CLI and libraries have evolved all these years, standardizing the way how commands are built and adding along with new functionalities like the use of colours, auto-completion, auto-correction etc. Yet there is a lot of scope for improvement, notably for creating a multilingual interface, obtaining the progress of a command, furthering the use of colours etc.</description><links /></event><event id="151"><persons /><person id="120">Fran&#231;ois Royer</person><start>15:00</start><duration>00:30</duration><room>A002</room><slug>developpez-vos-microservices-par-le-domain-driven-</slug><title>D&#233;veloppez vos Microservices par le Domain Driven Design et l'Event Sourcing</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Le "Domain Driven Design", ou DDD, permet aux d&#233;veloppeurs d'affronter des probl&#232;mes complexes en offrant la possibilit&#233; de construire un language commun clair, partag&#233; avec les experts m&#233;tiers. 

Nous pr&#233;senterons, code &#224; l'appui, comment le DDD permet de r&#233;soudre les probl&#232;mes rencontr&#233;s dans les architectures Microservices, et comment l'Event Sourcing am&#233;liore la lisibilit&#233;, la performance et l'auditabilit&#233; d'un syst&#232;me distribu&#233;.</description><links /></event><room name="A201" /><event id="191"><persons /><person id="155">Paul Kocialkowski</person><start>10:30</start><duration>01:00</duration><room>A201</room><slug>demarrage-verifie-et-logiciels-libres-reconcilier-</slug><title>D&#233;marrage v&#233;rifi&#233; et logiciels libres : r&#233;concilier libert&#233; et s&#233;curit&#233;</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>Un nombre croissant d'ordinateurs modernes, qu'il s'agisse d'ordinateurs x86 de bureau, portables ou encore d'appareils embarqu&#233;s, contient des dispositifs de v&#233;rification du premier logiciel de d&#233;marrage. En pratique, cela signifie souvent que seul le logiciel de d&#233;marrage autoris&#233; par le fabricant peut &#234;tre ex&#233;cut&#233; sur ces appareils, causant de s&#233;rieux probl&#232;mes de libert&#233; mais &#233;galement de s&#233;curit&#233;. Avec l'utilisation d'algorithmes de chiffrement asym&#233;trique pour assurer l'authenticit&#233; des ces logiciels, une clef priv&#233;e gard&#233;e secr&#232;te par le fabricant et une clef publique stock&#233;e en m&#233;moire non-r&#233;inscriptible, il devient impossible pour les utilisateurs finaux de compiler, installer ex&#233;cuter des logiciels de d&#233;marrage libres pour leur appareil.

Cependant, il existe plusieurs exemples d'appareils sur lesquels la v&#233;rification du d&#233;marrage est impl&#233;ment&#233;e d'une mani&#232;re permettant aux utilisateurs de garder le contr&#244;le de leurs appareils. En particulier, les appareils ChromeOS/ChromiumOS (CrOS) tels que les Chromebooks impl&#233;mentent une v&#233;rification du d&#233;marrage fiable et qui n'emp&#234;che pas l'utilisation de logiciels libres. Mieux encore, cette v&#233;rification du d&#233;marrage est impl&#233;ment&#233;e au travers de logiciels libres, &#224; la fois au niveau du logiciel de d&#233;marrage et du micrologiciel de l'embedded controller.

Cette pr&#233;sentation consistera ainsi en une description de l'&#233;tat actuel des techniques de v&#233;rification de logiciel de d&#233;marrage. Il s'agira dans un premier temps d'en d&#233;gager les probl&#233;matiques li&#233;es au logiciel libre et &#224; la vie priv&#233;e/s&#233;curit&#233; et dans un second temps de pr&#233;senter un mod&#232;le permettant d'apporter solution &#224; ces probl&#233;matiques.</description><links /></event><event id="212"><persons /><person id="168">Thomas BAILLEUX</person><start>11:30</start><duration>01:00</duration><room>A201</room><slug>introduction-et-prise-en-main-de-radare2-reverse-e</slug><title>introduction et prise en main de radare2 - reverse engineering</title><subtitle /><track>Securit&#233;</track><type>conference</type><language /><description>Pr&#233;sentation de radare2: outil d'analyse statique et dynamique d'un binaire
Prise en main et bons r&#233;flexes d'usages.
Live demo sur un exemple simple et concis</description><links /></event><room name="A202" /><event id="120"><persons /><person id="93">Jean-Tiare Le Bigot</person><start>10:30</start><duration>01:00</duration><room>A202</room><slug>pister-le-voyage-dun-paquet-reseau-lambda-sans-son</slug><title>Pister le voyage d'un paquet r&#233;seau lambda sans son consentement, avec perf et eBPF</title><subtitle /><track>Syst&#232;mes</track><type>conference</type><language /><description>Autrefois, pister un paquet &#233;tait intrusif. Il fallait g&#233;n&#233;ralement un
subtile m&#233;lange de strace, netstat, ss, tcpdump, ip netns exec, ... Si ce
sont des gros mots pour vous, pas de soucis, de toutes fa&#231;ons, on peut faire
mieux, beaucoup mieux.

Depuis quelques ann&#233;es, le projet IOVisor, d&#233;pendant le la Linux foundation
int&#232;gre pi&#232;ce par pi&#232;ce un langage de script dans le Kernel, le eBPF. D'abord
pens&#233; pour l'analyse de performance et le r&#233;seau, il permet aussi de surveiller
pratiquement n'importe quelle fonction du kernel de mani&#232;re compl&#232;tement
transparente et surtout s&#233;curis&#233;e.

Ce talk propose une introduction en douceur &#224; eBPF, partant de ce cas
d'utilisation. Je ne peux pas vous promettre de ma&#238;triser eBPF &#224; la fin
de ce talk, mais j'esp&#232;re vous avoir suffisamment montr&#233; de sa puissance
pour que vous soyez accrocs !</description><links /></event><event id="121"><persons /><person id="94">Guillaume Lacasa</person><start>11:30</start><duration>01:00</duration><room>A202</room><slug>avec-net-core-microsoft-rejoint-le-libre</slug><title>Avec .net core, Microsoft rejoint le libre</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>En 15 ans, les frameworks de d&#233;veloppement de Microsoft ont &#233;volu&#233; depuis des technologies "Windows only" &#224; une ouverture inimaginable il y a quelques ann&#233;es, puisque la derni&#232;re version du framework, .net core, est open-source (licence MIT) et multi-plateforme (compatible Linux et MacOs, avec support complet de Microsoft pour ces plateformes).

Points abord&#233;s
- historique de .net
- premi&#232;res tentatives multiplateforme (Mono)
- multiplication des frameworks (.net, Silverlight, Mono, Xamarin) et unification avec .net standards
- pr&#233;sentation de .net core
- D&#233;mo technique (.net core, asp.net core)</description><links /></event><event id="49"><persons /><person id="45">Borsalinux-Fr</person><start>14:00</start><duration>00:30</duration><room>A202</room><slug>schema</slug><title>Schema</title><subtitle /><track>D&#233;veloppement</track><type>conference</type><language /><description>On pr&#233;sentera Schema, une application web &#233;crite en Perl qui permet de g&#233;n&#233;rer automatiquement une documentation du sch&#233;ma d&#8217;une base de donn&#233;es.</description><links /></event><event id="164"><persons /><person id="130">Laurent CLAUDE</person><person id="131">Matthieu Hazon</person><start>14:30</start><duration>00:30</duration><room>A202</room><slug>mail2voice-vos-e-mails-ont-la-parole</slug><title>Mail2Voice : vos e-mails ont la parole</title><subtitle /><track /><type>conference</type><language /><description>La premi&#232;re version de Mail2Voice r&#233;pond depuis 6 ans &#224; des besoins particuliers pour une gestion simple et en autonomie des courriels aupr&#232;s d'utilisateurs en situation d'illettrisme, de handicap moteur ou cognitif.
La version 2 de Mail2Voice arrive avec son lot de nouveaut&#233;s, dont principalement : une interface repens&#233;e pour plus d'ergonomie et de personnalisations, une ouverture &#224; d'autres besoins (dyslexies), une robustesse accrue et bien-s&#251;r un support des syst&#232;mes Linux. Cette nouvelle version commence &#224; pointer plus que le bout de son nez... une b&#234;ta pour le Capitole ? Voici comment l'&#233;quipe de Mai2Voice a pens&#233; l'avenir de ce gestionnaire de courriels adapt&#233;. &#192; l'issue de cette pr&#233;sentation vous pourrez partager vos remarques et besoins.</description><links /></event><room name="A203" /><event id="230"><persons /><person id="185">Kevin Ottens</person><start>10:30</start><duration>01:00</duration><room>A203</room><slug>qt-3d-point-detape</slug><title>Qt 3D : Point d'&#233;tape</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>conference</type><language /><description>La 3D devient importante dans les applications en particulier pour les
R&#233;alit&#233;s Virtuelles et Augment&#233;es. C'est pourquoi Qt 5.7 a introduit le
module nomm&#233; Qt 3D. Bien s&#251;r, ce module continue &#224; &#233;voluer et cette
pr&#233;sentation mettra en &#233;vidence les nouveaut&#233;s introduites dans 5.8, 5.9 et
5.10.

L'&#233;criture de code de rendu 3D depuis z&#233;ro peut &#234;tre un probl&#232;me difficile.
De plus, l'architecture du moteur de rendu est un &#233;l&#233;ment critique de votre
application. Qt 3D prend en charge ces risques pour vous. Ainsi vous pourrez
vous concentrer sur la simulation elle m&#234;me et le contenu de votre sc&#232;ne 3D.

Dans cette pr&#233;sentation, nous ferons d'abord un bref rappel des bases de
l'API de Qt 3D. En particulier, elle est structur&#233;e autour d'une architecture
Entity Component System (ECS) qui sera d&#233;taill&#233;e.

Nous pr&#233;senterons ensuite les nouvelles fonctionnalit&#233;s introduites dans 5.8 et
5.9. En particulier nous parlerons de la possibilit&#233; de peindre dans des
texture et aussi nous montrerons comment int&#233;grer une sc&#232;ne QtQuick 2 dans un
sc&#232;ne en 3D. Nous pr&#233;senterons aussi les nouveaux mat&#233;riaux PBR, le syst&#232;me
d'animations et plus encore...

Si le temps nous le permet, nous donnerons aussi un premier aper&#231;u d'une
fonctionnalit&#233; en cours de d&#233;veloppement qui aidera &#224; la gestion du code de
shaders. Il s'agit d'une API priv&#233;e qui sera utilis&#233;e et expos&#233;e par QtQuick
et Qt 3D.

Cette pr&#233;sentation pourra int&#233;resser tout d&#233;veloppeur devant impl&#233;menter une
sc&#232;ne 3D dans une application en utilisant Qt. Aucune connaissance sur Open GL
ou la programmation GPU n'est requise pour la compr&#233;hension de cette
pr&#233;sentation.</description><links /></event><event id="170"><persons /><person id="136">Julien Duroure</person><start>11:30</start><duration>01:00</duration><room>A203</room><slug>rigging-automatique-dans-blender-tour-dhorizon</slug><title>Rigging automatique dans Blender - tour d'horizon</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>conference</type><language /><description>Le rigging est une &#233;tape importante pour l'animation 3D. Il permet de donner vie &#224; un objet/personnage statique en lui permettant le mouvement. Cela reste une &#233;tape assez technique et complexe.
A travers des exemples, nous parcourrions plusieurs outils qui permettent d'automatiser (plus ou moins) cette &#233;tape, comme Rigify, BlenRig, AutoRig Pro.</description><links /></event><room name="A302" /><event id="58"><persons /><person id="49">Adrien Destugues</person><start>10:30</start><duration>00:30</duration><room>A302</room><slug>haiku-16-ans-de-galere</slug><title>Haiku, 16 ans de gal&#232;re</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Haiku est un projet ambitieux qui consiste &#224; d&#233;velopper, &#224; partir de rien, un syst&#232;me d'exploitation complet pour les ordinateurs de bureau.

Cette ann&#233;e le projet a f&#234;t&#233; ses 16 ans. 16 ans, c'est long, et pourtant, il n'y a eu que 4 versions "alpha" dont la derni&#232;re date de 2012.

Pourquoi le projet Haiku est-il incapable de publier une version beta aujourd'hui? Cette conf&#233;rence fera le point sur les moments difficiles dans la vie du projet ces 16 derni&#232;res ann&#233;es, mais surtout sur la fa&#231;on dont le projet a tout de m&#234;me r&#233;ussi &#224; survivre et &#224; continuer.</description><links /></event><event id="200"><persons /><person id="161">Malory</person><start>11:00</start><duration>00:30</duration><room>A302</room><slug>militantismes-et-logiciels-libres</slug><title>Militantismes et logiciels libres</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Cette conf&#233;rence aborde la th&#233;matique du militantisme au sein du monde des logiciels libres. Au del&#224; du logiciel, pourquoi et comment militer pour/avec le libre ? dans quel but ? L'objectif est prendre du recul et d'ouvrir les discussions sur ces questions.</description><links /></event><event id="52"><persons /><person id="46">Ludovic Hirlimann</person><start>11:30</start><duration>00:30</duration><room>A302</room><slug>comment-participer-a-un-projet-open</slug><title>Comment participer &#224; un projet open*</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Je vais vous raconter comment je me suis invit&#233; dans le projet Mozilla , qui a finit par devenir mon gagne pain, et dans le projet OpenStreetMap. Vous donner des trucs et astuce pour que votre participation impact dans un projet soit plus forte. Bref mettre mon auditoire sur les rails pour devenir acteur de projets open source, open data</description><links /></event><event id="104"><persons /><person id="84">David Brown</person><start>12:00</start><duration>00:30</duration><room>A302</room><slug>traitez-votre-projet-open-source-comme-une-startup</slug><title>Traitez votre projet open source comme une startup</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Il est facile de nos jours de commencer un projet open source. Il en appara&#238;t tous les jours sur GitHub. Malheureusement beaucoup n'attirent que peu de monde et finissent par prendre la poussi&#232;re quand la motivation de l'unique contributeur d&#233;cline.</description><links /></event><event id="209"><persons /><person id="165">hellekin</person><start>14:00</start><duration>00:30</duration><room>A302</room><slug>technique-en-liberte</slug><title>Technique en libert&#233;</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Il existe une diff&#233;rence fondamentale d'ordre technique entre les logiciels libre et propri&#233;taire. Cette diff&#233;rence peut servir &#224; d&#233;finir une politique publique num&#233;rique. Cependant, le march&#233; sur l'Internet est biais&#233; par des mots creux et des concepts douteux.

Cette conf&#233;rence abordera certains de ces concepts g&#233;n&#233;ralement accept&#233;s pour les mettre en pi&#232;ce et montrer comment les utilisateurs peuvent r&#233;clamer les libert&#233;s collectives du libre dans leurs mains et transformer la perspective d'une soci&#233;t&#233; technologique. Nous r&#233;v&#232;lerons le projet Migration, une initiative radicale qui promeut au niveau europ&#233;en une infrastructure publique num&#233;rique &#233;tablie sur le logiciel libre.

*

There's a fundamental **technical** difference between free software and proprietary software. This difference can serve to define public digital policy. Meanwhile, the Internet market is being cheated with hollow words and dubious concepts.

This conference will take some usually accepted concepts to pieces and show how users can get back the collective freedoms of free software definitions into their own hands to transform the perspective on technological society. We will reveal the Migration project, a grassroots initiative that promotes at European level, a perennial public digital infrastructure based on free software.</description><links /></event><room name="A303" /><event id="206"><persons /><person id="163">Thierry Stoehr</person><start>10:30</start><duration>00:30</duration><room>A303</room><slug>orgmode-tout-en-mode-texte</slug><title>Orgmode, tout en mode texte</title><subtitle /><track /><type>conference</type><language /><description>Orgmode et ses outils associ&#233;s permettent de tout faire au format texte : prise de note, listes, calendrier, r&#233;daction et mise en forme de documents et bien plus encore. Une pr&#233;sentation de cet outil &#224; la puissance tr&#232;s importante.</description><links /></event><event id="98"><persons /><person id="80">Georges Khaznadar</person><start>11:00</start><duration>00:30</duration><room>A303</room><slug>un-serveur-wims-pour-les-sciences-dans-mon-lycee-q</slug><title>Un serveur WIMS pour les sciences, dans mon lyc&#233;e : qu'est-ce que &#231;a change ?</title><subtitle /><track>&#201;ducation</track><type>conference</type><language /><description>WIMS est un service d'exercices, diffus&#233;s &#224; travers Internet, qui permet d'organiser le travail de plusieurs classes. Chaque &#233;tudiant peut recommencer les exercices autant de fois que n&#233;cessaire, avec des contenus tir&#233;s au sort &#224; chaque essai.

WIMS est comme un &#233;l&#233;phant : tr&#232;s puissant, mais pas forc&#233;ment si intelligent que &#231;a. Pourtant, quand les &#233;l&#232;ves l'utilisent, cela modifie leur niveau de connaissance, et, &#233;trangement, leur comportement en classe. Nous verrons pourquoi.

Wims est un logiciel libre, cr&#233;&#233; il y a quelques vingt ans par Gang XIAO, professeur &#224; l'Universit&#233; de Nice. Le moteur du service web est sous licence libre GPL2+, ainsi que plusieurs milliers d'exercices. La plupart des modules d'enseignement correspondent aux math&#233;matiques, &#224; la physique, &#224; la chimie, &#224; la biologie, au fran&#231;ais, &#224; l'anglais. Le service est traduit en plusieurs langues.

Liens sur le web : 
- l'association Wims-&#201;du =&gt;http://wimsedu.info/
- une carte des serveurs Wims (rien en Occitanie ?) =&gt; http://downloadcenter.wimsedu.info/download/map/map.html
- essayez-vous &#224; un exercice =&gt; http://wims.lyceejeanbart.fr/wims/wims.cgi?module=H4/chemistry/oefmolecule.fr&amp;cmd=new&amp;exo=reconnaissance</description><links /></event><event id="114"><persons /><person id="91">Elzen</person><start>11:30</start><duration>01:00</duration><room>A303</room><slug>envisager-ses-recherches-autrement</slug><title>Envisager ses recherches autrement</title><subtitle /><track /><type>conference</type><language /><description>Et si une solution au probl&#232;me de la centralisation &#233;tait d'envisager les choses autrement, et de chercher de nouvelles mani&#232;res de r&#233;pondre aux probl&#232;mes plut&#244;t que de reproduire ce que l'on conna&#238;t jusque l&#224;&#160;?
Cette conf&#233;rence s'appuie sur les travaux que j'ai r&#233;alis&#233; durant ma th&#232;se, portant sur une approche communautaire pour l'&#233;valuation de requ&#234;tes continues. L'id&#233;e est de regrouper les usagers du r&#233;seau en fonction de leurs int&#233;r&#234;ts, utilisant la connexit&#233; entre les diff&#233;rentes requ&#234;tes pour mettre les diff&#233;rentes communaut&#233;s ainsi form&#233;es en relation et garantir le bon fonctionnement du syst&#232;me pour un co&#251;t raisonnable.
Au cours de cette conf&#233;rence, je pr&#233;senterai ces travaux et montrerai comment ils pourraient &#234;tre r&#233;utilis&#233;s dans un projet d'envergure qui pourrait, &#224; terme, proposer une alternative aux moteurs de recherche classique&#8230; &#224; condition que la communaut&#233; du libre s'en empare.</description><links /></event><room name="B00" /><event id="194"><persons /><person id="157">Yann Kervran</person><start>10:30</start><duration>01:00</duration><room>B00</room><slug>framabook-le-pari-du-livre-libre</slug><title>Framabook : le pari du livre libre</title><subtitle /><track>Le Libre en g&#233;n&#233;ral</track><type>conference</type><language /><description>Dans le cadre des actions de Framasoft existe depuis plusieurs ann&#233;es un groupe qui s&#8217;int&#233;resse au livre et &#224; l&#8217;&#233;dition. Comme dans les autres secteurs sur lesquels se penche l&#8217;association, il ne s&#8217;agit pas tant de d&#233;velopper une structure de grande taille que de rechercher de nouvelles fa&#231;ons de faire qui servent les int&#233;r&#234;ts du public, tout en faisant action d&#8217;&#233;ducation et d&#8217;information, le tout dans un contexte de culture et de technologie libres.

Le but de cette conf&#233;rence sera de pr&#233;senter les actions de Framabook, de d&#233;finir ses ambitions et ses projets. Il abordera aussi bien les aspects th&#233;oriques que les solutions pratiques exp&#233;riment&#233;es.

Le site de Framabook : https://framabook.org/</description><links /></event><event id="220"><persons /><person id="176">Gregory Estrade</person><start>11:30</start><duration>01:00</duration><room>B00</room><slug>la-nes-mini-classic-ce-quelle-aurait-du-etre</slug><title>La NES Mini Classic - ce qu'elle aurait d&#251; &#234;tre.</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Il y a quelques mois, Nintendo a r&#233;&#233;dit&#233; en format "miniature" la NES (et r&#233;cemment la SNES).
Ces consoles "new-retro" se sont arrach&#233;es tels des petits pains en quelques jours.

Pourtant, le syst&#232;me est d&#233;cevant, il ne s'agit ni plus ni moins qu'un SoC sur base ARM. On a donc affaire &#224; de l'&#233;mulation software, et on peut faire mieux pour moins cher avec un Raspberry Pi 3.

Pourquoi ne pas aller plus loin, en proposant une r&#233;impl&#233;mentation full-hardware dans un FPGA, mais en ne partant pas de z&#233;ro.

Je vous propose de commencer par une &#233;mulation software minimaliste, dont on convertira progressivement les parties logicielles &#233;crites en C vers des parties hardware d&#233;crites en Verilog, et on fait tourner ce syst&#232;me hybride logiciellement gr&#226;ce &#224; Verilator. 

Et au final, on obtient une NES non plus &#233;mul&#233;e, mais r&#233;impl&#233;ment&#233;e, sur laquelle on peut connecter des cartouches d'origine (et retrouver la joie de pouvoir souffler sur les cartouches, quand celles-ci ne veulent pas fonctionner).</description><links /></event><event id="53"><persons /><person id="46">Ludovic Hirlimann</person><start>12:30</start><duration>01:00</duration><room>B00</room><slug>pgp-key-signing-party-gpg</slug><title>PGP key signing party - GPG</title><subtitle /><track>Securit&#233;</track><type>atelier</type><language /><description>A 20 minute session to sign keys. You need to register before hand to boost participation and make things easier.</description><links /></event><event id="171"><persons /><person id="137">Pierre-Yves Gosset</person><start>14:00</start><duration>01:00</duration><room>B00</room><slug>nomavenir-degoogliser-ne-suffit-pas</slug><title>&#171; [NomAVenir] &#187;, D&#233;googliser ne suffit pas</title><subtitle /><track>&#201;ducation</track><type>conference</type><language /><description>En octobre 2014, l'association Framasoft lan&#231;ait un pari un peu fou : &#171; Et si on d&#233;googlisait Internet ? &#187;.
Ce (modeste) plan de lib&#233;ration du monde visait, en 3 ans &#224; :
  * sensibiliser le public sur la question de la centralisation des donn&#233;es, des atteintes &#224; la vie priv&#233;e, et des dominations des &#171; GAFAM &#187; (Google, Apple, Facebook, Amazon et Microsoft) ;
  * d&#233;montrer que le logiciel libre est une r&#233;ponse concr&#232;te &#224; ces dangers ;
  * essaimer la d&#233;marche, afin de cr&#233;er une r&#233;silience, et de faire en sorte que Framasoft ne soit pas le &#171; Google du libre &#187;.

Trois ans plus tard, l'objectif est atteint :
  * plusieurs centaines de conf&#233;rences, ateliers, stands, etc auront &#233;t&#233; tenus par des membres de l'association ;
  * 32 services libres, &#233;thiques, alternatifs et solidaires sont disponibles pour tou&#8901;te&#8901;s ;
  * la r&#233;cente naissance du collectif CHATONS ouvre une potentielle dynamique pour les ann&#233;es &#224; venir.

En octobre 2017, Framasoft souhaite se lancer dans une nouvelle campagne : &#171; [NomAVenir] &#187;
Ses objectifs :
  * outiller les personnes souhaitant &#339;uvrer &#224; une soci&#233;t&#233; plus libre et plus juste ;
  * favoriser les contributions de tous types aux logiciels libres et aux communs, notamment par les moldu&#8901;e&#8901;s du code ;
  * faciliter l'accompagnement des publics dans le choix, la prise en main, et l'usage des outils libres.

Pour cela, une douzaine de projets sont annonc&#233;s sur les ann&#233;es &#224; venir visant, chacun &#224; leur mani&#232;re, &#224; rapprocher les enjeux du libre et des communs de ceux de l'&#233;ducation populaire et de l'&#233;conomie sociale et solidaire.
La conf&#233;rence s'attachera &#224; pr&#233;senter le bilan de la campagne D&#233;googlisons, et les raisons qui nous am&#232;nent &#224; pense que &#171; d&#233;googliser ne suffit pas &#187;.</description><links /></event><room name="B207" /><event id="163"><persons /><person id="128">Julien Lavesque</person><person id="129">Maxime Cottret</person><start>10:30</start><duration>02:00</duration><room>B207</room><slug>hands-on-kubernetes</slug><title>Hands On Kubernetes</title><subtitle /><track>DevOps</track><type>atelier</type><language /><description>Le but de l'atelier est de pr&#233;senter Kubernetes et de manipuler les diff&#233;rents objets et concepts  au travers d'une application web classique:
 - D&#233;ploiement d'un cluster
 - D&#233;ploiement d'une base Mysql (concept de stockage, service et secret)
 - D&#233;ploiement d'un frontend web (scaling, load balancing, rolling update)</description><links /></event><event id="158"><persons /><person id="125">Augustin Riedinger</person><start>14:00</start><duration>02:00</duration><room>B207</room><slug>comment-utiliser-docker-pour-son-environnement-de-</slug><title>Comment utiliser Docker pour son environnement de dev ?</title><subtitle /><track>DevOps</track><type>atelier</type><language /><description>En tant que freelancer, je suis en permanence entrain de passer d'un projet &#224; l'autre. Cela pose pas mal de probl&#232;mes lorsque deux projets utilisent des versions incompatibles de logiciels. C'est ce qui a &#233;t&#233; ma principale motivation &#224; sandboxer tout mon environnement de dev dans docker.

En faisant des recherches, je me suis rendu compte que le web ne d&#233;bordait pas de ressources &#224; ce sujet. Aussi, j'ai pris soin d'en faire un article : https://augustin-riedinger.fr/en/resources/using-docker-as-a-development-environment-part-1 qui a &#233;t&#233; bien re&#231;u par la communaut&#233; Docker (RT de Docker officiel).

Je pense que le tutoriel pourrait en int&#233;resser d'autres, d'autant qu'il peut aussi bien faire office d'introduction g&#233;n&#233;rale &#224; Docker et je pourrais donc l'animer sous forme d'atelier interactif.

Pr&#233;-requis : avoir docker install&#233; sur sa machine.</description><links /></event><room name="B208" /><event id="66"><persons /><person id="50">Nathan Lovato</person><start>10:30</start><duration>02:00</duration><room>B208</room><slug>decouverte-de-la-creation-de-jeux-video-avec-godot</slug><title>D&#233;couverte de la cr&#233;ation de jeux vid&#233;o avec Godot</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>atelier</type><language /><description>Venez d&#233;couvrir le moteur de jeux Godot! En quelques heures, vous apprendrez &#224; cr&#233;er votre premier jeu vid&#233;o. Les d&#233;butants comme les d&#233;veloppeurs sont les bienvenus: pass&#233; l'introduction, deux niveaux de difficult&#233; sont propos&#233;s.

Apportez votre bonne humeur, &#224; boire, et un ordinateur portable.</description><links /></event><event id="176"><persons /><person id="141">Nicolas Auvray</person><start>14:00</start><duration>02:00</duration><room>B208</room><slug>decouvrez-0-ad-un-str-libre-gratuit-et-open-source</slug><title>D&#233;couvrez 0 A.D., un STR libre, gratuit et open-source !</title><subtitle /><track>Jeux Libres</track><type>atelier</type><language /><description>0 A.D. est un jeu de strat&#233;gie en temps r&#233;el (STR) libre, gratuit et open-source. Prenez le contr&#244;le d'une faction de l'Antiquit&#233; et jouez contre l'ordinateur, en r&#233;seau local ou sur Internet ! D&#233;couvrez des graphismes magnifiques, une bande-son originale et des m&#233;caniques de jeu r&#233;alistes.
Amenez votre ordinateur, le jeu est installable sur n'importe quel syst&#232;me d'exploitation et nous pourrons le d&#233;couvrir ensemble. Une LAN sera organis&#233;e pour ceux et celles qui connaissent d&#233;j&#224; 0 A.D. Nous jouerons avec la derni&#232;re version du jeu, Alpha 22 Venustas.

L'atelier durerait id&#233;alement une heure. Il me faudrait un vid&#233;oprojecteur (VGA ou HDMI) et les participant.e.s devront pouvoir se connecter en r&#233;seau local pour faire une partie ensemble.</description><links /></event><room name="B306" /><event id="140"><persons /><person id="109">Naomi Testard</person><person id="110">Axel Viala</person><start>10:30</start><duration>02:00</duration><room>B306</room><slug>initiation-a-la-programmation-systeme-avec-rust</slug><title>Initiation &#224; la programmation syst&#232;me avec Rust</title><subtitle /><track /><type>atelier</type><language /><description>Rust, &#171; nouveau &#187; langage de programmation d&#233;velopp&#233; par Mozilla, rend la programmation syst&#232;me et bas niveau plus s&#251;re et plus facile en rendant le contr&#244;le sur la m&#233;moire explicite. Cet atelier se propose de vous faire d&#233;couvrir ce type de programmation en utilisant Rust. Atelier ouvert &#224;&#160;toute personne ayant d&#233;j&#224; des notions de programmation. Aucune connaissance pr&#233;alable de la programmation syst&#232;me ou de Rust n'est n&#233;cessaire.</description><links /></event><event id="240"><persons /><person id="190">Adrien Blind</person><start>14:00</start><duration>02:00</duration><room>B306</room><slug>atelier-docker</slug><title>Atelier Docker</title><subtitle /><track>DevOps</track><type>atelier</type><language /><description>Atelier Docker</description><links /></event><room name="B307" /><event id="205"><persons /><person id="131">Matthieu Hazon</person><start>10:30</start><duration>02:00</duration><room>B307</room><slug>dessinez-avec-inkscape</slug><title>Dessinez avec Inkscape</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>atelier</type><language /><description>Envie de cr&#233;er vos illustrations, logos ou maquettes graphiques ? Que vous ayez le coup de crayon ou que vous soyez novice, Inkscape est fait pour vous ! Venez profiter de cet atelier pour d&#233;couvrir ce logiciel de dessin vectoriel qui offre un vaste terrain de jeu.
Nous aborderons ensemble les fondamentaux du logciel et nous explorerons ses multiples facettes &#224; travers la cr&#233;ation d'un dessin de A &#224; Z.

Nous nous baserons sur les versions les plus r&#233;centes du logiciel (version 0.91 minimum).</description><links /></event><event id="167"><persons /><person id="134">Livio Fania</person><start>14:00</start><duration>02:00</duration><room>B307</room><slug>whiteboard-animation-avec-kdenlive</slug><title>Whiteboard Animation avec Kdenlive</title><subtitle /><track>3D, Cr&#233;ation graphique et multim&#233;dia</track><type>atelier</type><language /><description>Mon atelier permettrait aux participants de r&#233;aliser une vid&#233;o explicative dessin&#233;e de la dur&#233;e de 30 secondes, en utilisant exclusivement des logiciels libres : Kdenlive + Audacity + Cheese. 

Vid&#233;o d'exemple : http://selenox.com/video-explicative/</description><links /></event><room name="B308" /><event id="132"><persons /><person id="104">Alexandre Garnier</person><start>10:30</start><duration>02:00</duration><room>B308</room><slug>bien-reussir-un-merge-avec-git</slug><title>Bien r&#233;ussir un merge avec Git</title><subtitle /><track>D&#233;veloppement</track><type>atelier</type><language /><description>Git vous permet de facilement versionner vos sources et de travailler en parall&#232;le gr&#226;ce aux branches. Mais il faut ensuite r&#233;concilier ces branches et l&#224; les choses peuvent se g&#226;ter... Dans cet atelier je vous propose de voir comment Git effectue un merge, ce qu'est un conflit et pourquoi il a lieu, puis comment le r&#233;soudre.</description><links /></event><event id="99"><persons /><person id="80">Georges Khaznadar</person><start>14:00</start><duration>02:00</duration><room>B308</room><slug>wims-creez-votre-classe-virtuelle-donnez-du-travai</slug><title>Wims : cr&#233;ez votre classe virtuelle, donnez du travail &#224; vos &#233;l&#232;ves tout de suite</title><subtitle /><track>&#201;ducation</track><type>atelier</type><language /><description>Vous avez suivi la conf&#233;rence sur Wims, et vous savez d&#233;j&#224; &#224; quoi vous en tenir, ou vous visitez l'adresse http://wims.lyceejeanbart.fr/wims/ et vous y avez d&#233;nich&#233; des exercices int&#233;ressants pour vos &#233;tudiants.

Durant cet atelier, vous pourrez cr&#233;er une classe virtuelle pour vos &#233;tudiants, et leur donner du travail &#224; faire. D'exp&#233;rience, il suffit ensuite de prendre une demi-heure pour expliquer aux &#233;tudiants comment r&#233;ussir au mieux, pour qu'une dynamique vertueuse s'engage.

Vous y verrez aussi une petite valise, qu'on branche sur une prise de courant. Elle donne naissance &#224; un point d'acc&#232;s WIFI nomm&#233; "Wims-air". Si votre t&#233;l&#233;phone est &#224; port&#233;e, vous avez du grain &#224; moudre !</description><links /></event><room name="C002" /><event id="185"><persons /><person id="149">Benjamin Benifei et Xavier Mouton-Dubosc</person><person id="150">Benjamin Benifei</person><start>10:30</start><duration>01:00</duration><room>C002</room><slug>hashtag-gdprbullshit-qui-la-vraiment-lu</slug><title>Hashtag #GDPRbullshit , qui l'a vraiment lu ?</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>Ce qu'il faut vraiment savoir sur le GDPR et ce qu'il faut vraiment ne pas &#233;couter.
Accessoirement, ce qu'il faut faire d'ici le 25 Mai 2018.

Lecture sur l'origine, l'existant, ce qui a &#233;t&#233; appliqu&#233; jusque-l&#224;, ce qui devait &#234;tre appliqu&#233;, ce qui arrive vraiment, l'&#233;ch&#233;ance et toutes les rumeurs folles et caricaturales.
D&#233;mystifications et d&#233;senvoutage sur sc&#232;ne.</description><links /></event><event id="199"><persons /><person id="160">Les Ex&#233;g&#232;tes Amateurs</person><start>11:30</start><duration>01:00</duration><room>C002</room><slug>le-combat-par-le-droit</slug><title>Le combat par le droit</title><subtitle /><track>Libert&#233;s et vie priv&#233;e</track><type>conference</type><language /><description>Pr&#233;sentation dynamique des actions-cl&#233;s men&#233;es par les Ex&#233;g&#232;tes Amateurs ou comment passer par les tribunaux pour faire valoir les libert&#233;s sur Internet.</description><links /></event></day></schedule>